{
  "input_file_path": "C:/Users/moris/Desktop/large project/notebooks/reviews_à_regarder_accessiblego.csv",
  "output_path": "..\\data\\processed\\validation\\reviews_à_regarder_accessiblego_chunks_labeled.csv",
  "current_review_index": 200,
  "current_chunk_index": 0,
  "total_reviews": 1119,
  "max_length": 128,
  "chunks_per_review": [
    1,
    1,
    2,
    2,
    1,
    2,
    11,
    1,
    1,
    1,
    2,
    5,
    1,
    1,
    3,
    1,
    1,
    1,
    1,
    3,
    1,
    1,
    2,
    1,
    1,
    1,
    1,
    2,
    1,
    1,
    1,
    3,
    5,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    2,
    2,
    1,
    1,
    5,
    1,
    1,
    2,
    1,
    1,
    1,
    3,
    1,
    1,
    1,
    1,
    2,
    1,
    1,
    1,
    2,
    1,
    2,
    1,
    1,
    2,
    1,
    1,
    4,
    1,
    4,
    1,
    1,
    2,
    9,
    6,
    2,
    1,
    1,
    1,
    1,
    3,
    1,
    3,
    1,
    1,
    3,
    1,
    2,
    1,
    1,
    2,
    2,
    1,
    1,
    1,
    1,
    1,
    2,
    1,
    2,
    1,
    3,
    1,
    1,
    1,
    1,
    1,
    3,
    1,
    1,
    1,
    1,
    1,
    14,
    3,
    1,
    1,
    1,
    1,
    1,
    2,
    1,
    1,
    2,
    2,
    2,
    1,
    2,
    1,
    2,
    2,
    1,
    2,
    5,
    1,
    1,
    1,
    2,
    2,
    2,
    2,
    3,
    1,
    1,
    1,
    1,
    4,
    1,
    1,
    1,
    2,
    5,
    1,
    5,
    2,
    2,
    1,
    1,
    1,
    1,
    2,
    5,
    3,
    1,
    1,
    3,
    1,
    1,
    1,
    12,
    1,
    1,
    14,
    1,
    2,
    1,
    3,
    1,
    1,
    1,
    1,
    1,
    1,
    2,
    1,
    3,
    1,
    1,
    4,
    1,
    11,
    1,
    1,
    1,
    3,
    1,
    1,
    1,
    1,
    1,
    2,
    2,
    2,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    2,
    2,
    2,
    2,
    4,
    1,
    1,
    1,
    2,
    2,
    1,
    1,
    1,
    1,
    2,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    2,
    1,
    1,
    1,
    1,
    1,
    1,
    3,
    1,
    2,
    1,
    2,
    2,
    2,
    1,
    3,
    3,
    1,
    1,
    3,
    1,
    1,
    1,
    1,
    1,
    2,
    1,
    1,
    2,
    1,
    1,
    1,
    4,
    1,
    2,
    1,
    1,
    1,
    1,
    1,
    1,
    9,
    4,
    1,
    3,
    1,
    1,
    1,
    2,
    1,
    1,
    1,
    1,
    4,
    1,
    1,
    1,
    2,
    2,
    1,
    1,
    1,
    3,
    1,
    1,
    3,
    2,
    1,
    1,
    2,
    2,
    1,
    1,
    1,
    2,
    2,
    3,
    2,
    1,
    1,
    6,
    2,
    1,
    2,
    1,
    1,
    1,
    7,
    1,
    1,
    3,
    2,
    2,
    1,
    1,
    1,
    1,
    2,
    2,
    1,
    1,
    1,
    1,
    1,
    3,
    1,
    2,
    1,
    1,
    1,
    9,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    4,
    1,
    1,
    1,
    1,
    5,
    1,
    1,
    1,
    1,
    1,
    2,
    1,
    1,
    2,
    1,
    2,
    2,
    2,
    1,
    1,
    1,
    1,
    2,
    1,
    1,
    1,
    1,
    1,
    2,
    3,
    1,
    1,
    1,
    2,
    2,
    2,
    1,
    2,
    1,
    1,
    2,
    1,
    1,
    5,
    1,
    3,
    1,
    1,
    3,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    2,
    1,
    3,
    1,
    1,
    4,
    1,
    1,
    1,
    2,
    1,
    2,
    1,
    1,
    2,
    1,
    3,
    2,
    4,
    1,
    3,
    1,
    1,
    1,
    1,
    1,
    2,
    2,
    2,
    2,
    1,
    2,
    1,
    2,
    1,
    14,
    2,
    2,
    1,
    1,
    1,
    1,
    1,
    1,
    2,
    2,
    1,
    1,
    1,
    1,
    2,
    1,
    2,
    1,
    2,
    1,
    2,
    1,
    1,
    1,
    1,
    3,
    1,
    11,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    6,
    1,
    2,
    3,
    1,
    1,
    1,
    1,
    1,
    2,
    3,
    3,
    1,
    1,
    1,
    1,
    3,
    1,
    6,
    1,
    1,
    2,
    1,
    1,
    1,
    1,
    1,
    1,
    4,
    1,
    1,
    3,
    1,
    2,
    1,
    2,
    1,
    1,
    1,
    2,
    3,
    2,
    1,
    4,
    2,
    1,
    2,
    1,
    1,
    4,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    2,
    1,
    1,
    2,
    1,
    1,
    1,
    2,
    4,
    2,
    1,
    1,
    1,
    3,
    2,
    1,
    1,
    2,
    3,
    1,
    1,
    1,
    2,
    1,
    1,
    1,
    1,
    2,
    1,
    1,
    1,
    1,
    2,
    3,
    3,
    1,
    2,
    2,
    1,
    1,
    1,
    2,
    1,
    1,
    1,
    2,
    1,
    1,
    3,
    6,
    1,
    2,
    1,
    4,
    1,
    2,
    1,
    1,
    3,
    1,
    1,
    1,
    1,
    1,
    2,
    1,
    4,
    1,
    2,
    1,
    1,
    1,
    1,
    2,
    2,
    1,
    3,
    1,
    2,
    2,
    1,
    1,
    1,
    1,
    2,
    3,
    3,
    3,
    1,
    2,
    1,
    1,
    3,
    1,
    1,
    2,
    1,
    2,
    1,
    1,
    1,
    1,
    2,
    2,
    1,
    1,
    1,
    1,
    2,
    2,
    5,
    3,
    2,
    1,
    2,
    2,
    5,
    1,
    1,
    5,
    1,
    4,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    2,
    1,
    2,
    1,
    1,
    1,
    3,
    1,
    1,
    2,
    2,
    1,
    1,
    1,
    5,
    1,
    1,
    1,
    1,
    1,
    1,
    2,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    2,
    3,
    1,
    1,
    1,
    1,
    1,
    2,
    22,
    1,
    2,
    2,
    1,
    1,
    1,
    1,
    1,
    2,
    1,
    2,
    1,
    1,
    1,
    1,
    1,
    2,
    1,
    9,
    1,
    1,
    1,
    1,
    2,
    3,
    1,
    1,
    1,
    1,
    2,
    1,
    1,
    1,
    1,
    1,
    2,
    4,
    2,
    4,
    1,
    2,
    1,
    2,
    2,
    1,
    2,
    3,
    1,
    2,
    2,
    2,
    1,
    1,
    1,
    1,
    1,
    6,
    2,
    1,
    2,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    2,
    1,
    1,
    1,
    2,
    1,
    2,
    2,
    1,
    1,
    1,
    1,
    10,
    1,
    2,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    2,
    1,
    1,
    2,
    1,
    1,
    5,
    1,
    3,
    1,
    1,
    3,
    1,
    1,
    1,
    1,
    2,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    2,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    2,
    1,
    1,
    2,
    1,
    1,
    1,
    1,
    2,
    1,
    3,
    1,
    2,
    7,
    4,
    1,
    1,
    6,
    1,
    1,
    1,
    1,
    11,
    1,
    1,
    2,
    3,
    1,
    1,
    1,
    1,
    1,
    2,
    1,
    2,
    2,
    1,
    1,
    1,
    1,
    4,
    1,
    1,
    4,
    1,
    2,
    1,
    2,
    1,
    1,
    1,
    2,
    1,
    1,
    2,
    2,
    1,
    3,
    1,
    1,
    4,
    4,
    4,
    1,
    3,
    2,
    1,
    5,
    2,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    3,
    1,
    1,
    1,
    3,
    1,
    1,
    1,
    2,
    1,
    1,
    1,
    3,
    1,
    1,
    2,
    2,
    5,
    1,
    1,
    1,
    1,
    3,
    1,
    3,
    1,
    5,
    4,
    1,
    1,
    1,
    1,
    1,
    1,
    2,
    2,
    1,
    2,
    1,
    4,
    1,
    1,
    1,
    2,
    1,
    1,
    1,
    2,
    2,
    1,
    1,
    2,
    1,
    1,
    1,
    4,
    1,
    1,
    1,
    1,
    2,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    3,
    1,
    1,
    1,
    1,
    3,
    6,
    34,
    1,
    1,
    2,
    2,
    1,
    1,
    2,
    1,
    2,
    1,
    1,
    2,
    1,
    5,
    2,
    1,
    3,
    1,
    1,
    2,
    2,
    3,
    1,
    2,
    5,
    1,
    1,
    1,
    1,
    1,
    2,
    1,
    2,
    2,
    1,
    3,
    1,
    12,
    1,
    1,
    1,
    2,
    2,
    1,
    4,
    1,
    2,
    1,
    2,
    1,
    2,
    1,
    1,
    1,
    2,
    1,
    2,
    6,
    1,
    1,
    1,
    2,
    1,
    1,
    1,
    1,
    1,
    1,
    3,
    1,
    1,
    1,
    2,
    1,
    1,
    2,
    1,
    1,
    1,
    1,
    1,
    1,
    4,
    1,
    4,
    1,
    3,
    2,
    2,
    2,
    1,
    1,
    1,
    1,
    1,
    1,
    2,
    1,
    1,
    1,
    2,
    1,
    2,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    3,
    3,
    1,
    2,
    1,
    1,
    2,
    1
  ],
  "labeled_chunks": [
    {
      "review_index": 0,
      "chunk_index": 0,
      "chunk_text": "Hi: Newly disabled (use a cane presently) and at a loss for planning vacations for my family, all of whom eat vegan. Prefer domestic travel to start. Any recommendations?",
      "handicap": 1,
      "pet": 0,
      "child": 1
    },
    {
      "review_index": 1,
      "chunk_index": 0,
      "chunk_text": "Looking for accessible stuff to do in Charleston. We will be close to Daniel Island. We like the beaches, Looking to rent/use beach chair. What other cool stuff is accessible and avilable that tourists don’t know about?",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 2,
      "chunk_index": 0,
      "chunk_text": "My name is Mark. I am 51 years old Marine Veteran I got paralyzed from the Covid vaccine second shot on September 5, 2021. I had taken the second shot Moderna on September 3. At the time I was in peak shape. I was taking a shower, I put my head down I went numb from toe to neck. I initially could only move my head. Now, I can talk, move my arms, not fingers everything else paralyzed neck down, but I have a stand up wheelchair to get around and I bought a 50lb hoyer to travel with. Before paralyzation traveled 300 days a year for 10",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 2,
      "chunk_index": 1,
      "chunk_text": "plus years. Since I haven’t. I hope to start traveling this new year.",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 3,
      "chunk_index": 0,
      "chunk_text": "We’ll be in Quito for 2 nights before heading home next week and would like to stay in the Historic District in a nice hotel. I’ve been scouring the typical search sites (booking.com, kayak, Trivago, etc) and oddly none of them seem to have the filter (that I know I’ve seen/used before) present for “elevator” when searching Quito. Definitely in need of some 1st hand intel. Anywho… I am in a wheelchair and although we can manage a flight of steps here or there, being that it’s at the end of our trip, it would be great to find somewhere with an elevator or ground floor rooms (and",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 3,
      "chunk_index": 1,
      "chunk_text": "little to no other steps necessary to get into/around the building). Our max budget is around $130/nt. Any suggestions would be greatly appreciated. Thanks!",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 4,
      "chunk_index": 0,
      "chunk_text": "From a member of our community: I have a spinal cord injury where I can stand or sit for very limited amounts of time. I am trying to research transportation options where I can lay flat whether by air travel or car rides with a paid driver. In the past, I have bought 3 airline seats in order to lay down on certain routes, mainly Southwest, but wondering if anyone has advice here. Can anyone recommend domestic airlines that allow you to lay flat (probably only business or first class), or transportation companies you can hire for long rides where you can lay down? Thanks everyone!",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 5,
      "chunk_index": 0,
      "chunk_text": "Hi, I was recently put into a Powerchair/wheelchair and am traveling for the first time in years. Due to a mix up, no transport was set up for me to get from the airport (Reagan DCA) to the hotel (Yotel DC) and back again, after the stay. I’m traveling Oct 19, 2021 thru Oct 21, 2021. If anyone has any experience with this and /or could possibly suggest a company I could call to get this set up, it would be very much appreciated. I’ve never used a wheelchair before (well, not all the time anyway) and am still getting used to it.I plan on using an overnight",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 5,
      "chunk_index": 1,
      "chunk_text": "bag, as a carry on and will hold it in my lap. Looking for my owners manual, I think I might have to remove the batteries…but wanted to get this posted. 😊 Thank you very much for any help!",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 6,
      "chunk_index": 0,
      "chunk_text": "The New Premier Caribbean Hotel for Wheelchair Accessible Travelers has now opened in St. Maarten The Morgan Resort & Spa - St Maarten Luxury ResortMy husband and I were lucky enough to get to be the very first wheelchair guests at the new Morgan Hotel this past May and we were in love at first sight. From the moment you arrive at the property you know you have arrived somewhere very special as you pass through two sets of gates and guard houses before reaching the glamorous front of the hotel; where the amazingly friendly valet/door-people will help you out of your vehicle. Whether it’s helping to assemble",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 6,
      "chunk_index": 1,
      "chunk_text": "back your manual wheelchair or safely unloading a power wheelchair, the staff was obviously trained well as to how to best assist us wheeled travelers. (They will even help carry every last piece of equipment you may have traveled with; and we brought a lot)As you enter the glamorous but modestly sized lobby, you can’t help but take your eyes off of the giant, gorgeous infinity pool overlooking the ocean that’s just on the other side of the lobby(*Will come back to the pool in a sec). The amazing front desk staff and concierge will not only help you get checked in, but will personally escort you to",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 6,
      "chunk_index": 2,
      "chunk_text": "your room to help orient you with the hotel amenities and make sure you have everything you need while settling in (ask for Arielle; she’s phenomenal). After taking some time to explore the giant accessible room and attached living room, I noticed how they remembered all the little details that are most important to us accessible travelers: lowered closets, electrical controls all within reach, access to the entire room; accessible bathroom with roll under sink, safety toilet (with good amount of grab bars), roll-in shower (flip down benches on order to replace shower chairs); handheld+waterfall shower heads; as well as having the coffee machine, safe and fridge within",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 6,
      "chunk_index": 3,
      "chunk_text": "reachable zone.Honestly I was blown away by how much they got right with the room; especially after staying at some insane nightmare hotels in the caribbean that claimed to be accessible prior to booking the room. Whoever designed this hotel really took the time to plan out what was needed for their 9 (yes I said 9) accessible rooms and oceanfront suites. What impressed me even more, was the General Manager (Saul) took the time to sit down with us to get some feedback about how we were finding the accessible features of the hotel; and took the time to walk around the property and room with us",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 6,
      "chunk_index": 4,
      "chunk_text": "and his builder to see what else could be improved on as they were finishing up the property. (Which was not much at all. Just some little stuff like a lower peep hole for the door, changing the bathroom door handle to add a few inches of entry area and changing from shower seats to benches for safety).Just like many hotels where we try to give some critical feedback on the accessibility of the property, they could have just humored us and pretended to care; but no, not these folks. They truly seem to be concerned about making the changes ASAP so that ALL guests get the chance",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 6,
      "chunk_index": 5,
      "chunk_text": "to enjoy their property equally. That’s not something you find often in any hotel; let alone a hotel in the Carribean. They even are ordering some beach wheelchairs to use for the pool and maybe even the neighboring beaches. (They can even rent you a beach wheelchair from a local company to be able to take to the other beaches on the island who will bring the chair right to you at that beach and come back at the end of the day for it).Now speaking of their fabulous pool. Never in my life have I seen such a large pool with zero-degree entry going around the entire",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 6,
      "chunk_index": 6,
      "chunk_text": "sides of this football field sized pool. (There is a regular entry point of the pool too if that’s easier). You’ll never want to get out of this pool and you probably won’t need to since the fantastic pool staff bring you anything you need and the bar in the water will fulfill all your cocktail and food fantasies. What I loved was the fact they had these soft pool chairs surrounding the pool (1’ away) that I could easily pull myself out of the water and right into the chair from. The only negative I will say about any of this is the fact that they put",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 6,
      "chunk_index": 7,
      "chunk_text": "the hot tub in the middle of the pool with no other entry point and you have to go up stairs and down stairs to switch bodies of water. There also is a really cool swim in a cave in the corner with a built in waterslide; but no way to get to the top of the slide if your legs don’t work (not that my spine Dr. would appreciate me trying slides…lol).If you can drag yourself away from the pool, you must try the restaurant and bar. Chef David will BLOW YOUR MIND with his food. He hit it out of the park on his first try",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 6,
      "chunk_index": 8,
      "chunk_text": "with the opening menu for the hotel. My spouse couldn’t stop raving about the Lobster and the Seafood Paella and I was obsessed with the vegetarian items on the menu; especially the Empanadas (They even serve an Impossible burger; which is so hard to find in St. Maarten). Every single thing we tried for breakfast was delicious and will fill you up well for your busy day on the island. Try the fruit and bread platter if you can or the pancakes will have you licking the plate. Or if you don;t feel like dining, try out the bar and let the Bartender Nigel make you one of",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 6,
      "chunk_index": 9,
      "chunk_text": "his enticing cocktails (let alone he’s the nicest guy to talk to on the island).I wish I could list every single person who went out of their way to take care of our every need at the hotel; but it would add an entire page to this review. Let’s just say I can’t say one negative thing about any of the employees at the hotel. They all made us feel so welcome and treated us as if we were visiting their own home. Leaving was the most difficult part of our entire visit at the hotel. We spent two life changing weeks at the Morgan and tried out",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 6,
      "chunk_index": 10,
      "chunk_text": "every aspect of that resort and they passed every test we threw at them. There are very few hotels I have ever fallen in love with, but this one definitely moved into my heart for life and I can’t wait to return. (Or move to the island… that is how much they made us fall in love with St. Maarten here) Please trust me, you won’t be disappointed and you’ve never enjoyed yourself more on vacation till you stay here. (You don’t even have to have a wheelchair to have as good of a time as us).",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 7,
      "chunk_index": 0,
      "chunk_text": "Hello everyone. My name is Diane Wildowsky and my friend and I have started a new website/blog helping people navigate NYC using a mobility scooter. I include wheelchairs where I can. I ride the subway and buses almost daily with my scooter. And while a restroom might be marked “accessible,” you learn very quickly, it isn’t always accessible for everyone. Look forward to meeting you all and happy to answer questions. Thank you in advance for taking time to look at our site. Paint the Town Mobile Paint the Town Mobile",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 8,
      "chunk_index": 0,
      "chunk_text": "I’m looking for a three-bedroom house or condo near or on a beach in close proximity to Kailua/Kona that is totally wheelchair accessible with a roll in shower. In the best of all worlds it would have an Ohana on site for my caregiver as well. I’m familiar with availability for accessible public transportation but would like the option of renting a lift equipped vehicle as well. Also, if anyone knows of in-home care options on Hawaii I would greatly appreciate that as well. Thanks, Tim",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 9,
      "chunk_index": 0,
      "chunk_text": "Hi everyone! I am from Sacramento, California, I am 65 years young, been on a wheelchair since 2015 and I happen to get a Atto scooter that helps me move around every now and then.. I love exploring the world …",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 10,
      "chunk_index": 0,
      "chunk_text": "Thing to see and do in following ports My husband and I are scheduled to take a Caribbean cruise in March 2024. We both travel in Prides scooters, which makes booking accessible excursions with the ship most impossible. We enjoy getting off the ship and do sightseeing around the port of call. We will be in the following ports and would like to suggestions of we things we might do and/or see in the following ports: St. Maarten , Antigua, St. Kitts, Tortola, BVI, Martinique, St. Lucia, Dominica, and Grand Turk, Turks & Caicos Thank you to everyone who reads our request even if you can’t or don’t",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 10,
      "chunk_index": 1,
      "chunk_text": "respond. If you do an extra special thank you.",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 11,
      "chunk_index": 0,
      "chunk_text": "Hello and good afternoon! My name is Karen and I am a 59 year old plus sized woman (currently 305 lbs coming down from originally being 430 lbs). I currently own a Pride Victory 10 mobility scooter because at the time I got it (5 years ago) that was the only mobility scooter Medicare would cover (at 80%) for a person weighing over 430 pounds. I would be very grateful on any advice/opinions any of you have on folding wheelchairs. Being as I have had my mobility scooter for quite a few years now, it is time to get something new again. Do I get another scooter, do",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 11,
      "chunk_index": 1,
      "chunk_text": "I get a power wheelchair, or do I get one of those plus a folding wheelchair??? All decisions I need to make and would sure appreciate your input. I do not own and cannot afford to buy a vehicle with a lift (on SSDI with very limited income), so I got ADA certified and ride a paratransit bus that has a lift here in Phoenix, Az to my doctors appointments, pharmacy, etc….The problem is I have no social life, or way to go out to do anything fun like out to dinner with friends, going to a mall, craft fairs, visit friends houses etc because paratransit will not",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 11,
      "chunk_index": 2,
      "chunk_text": "take me to anywhere other than medically related places. I did not know about folding wheelchairs until just recently. It folds up, I can put it in the trunk of a friends vehicle, put it in the trunk of a Uber…..I could actually go places and do things again!! Plus just on a side note in case this helps someone else decide on a scooter…my Pride Victory 10 has been wonderful, very relaible, never a problem. However it is big, wide, heavy even broken down into pieces, and longer than most other scooters because it is a bariatric sized scooter as well. It for sure causes issues at",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 11,
      "chunk_index": 3,
      "chunk_text": "times because of the turning radius, space in restaurants, it’s longer than most street vans with ramps up the back can usually fit. Allll of that being said (whew!!) what do you all think of FOLDING wheelchairs? It would still have to be for a plus sized me, so I would need a weight capacity over 305 lbs. Are they comfortable, relaible, can I even lift one by myself or would I need constant help to be able to use it by myself? Brand names you recommend and why?? Sorry for the book, I just wanted to tell you as much as I could so you could know",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 11,
      "chunk_index": 4,
      "chunk_text": "what I would need better maybe??? Any information or suggestions would be very much appreciated. Thank you and have a great day! Karen",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 12,
      "chunk_index": 0,
      "chunk_text": "From a member of our community: I want to travel to Singapore and Phuket with my husband and two children however we are struggling to find accommodation to suit our needs. We require hotel rooms where we can stay together but have a shower where I can get my wheelchair in for a roll-in shower, can you give me some advice please as to where to look? Thank you!",
      "handicap": 1,
      "pet": 0,
      "child": 1
    },
    {
      "review_index": 13,
      "chunk_index": 0,
      "chunk_text": "My husband just sent me this article! I haven’t even read all of it, but what I have read is concerning. What are your thoughts? Carnival Cruise Line Cracking Down on Mobility Scooters https://l.smartnews.com/p-S9e2j/TEJBeD",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 14,
      "chunk_index": 0,
      "chunk_text": "We finally went, we stayed for a whole week. My daughter with multiple disabilities, autism intellectually delayed and others had the best time of her life. What a super great birthday. What Disney World is handicap accessible however I did have a hard time navigating in Universal Studios. Definitely need two. Good pair of walking shoes day three red wheelchair and my oldest did push me around everywhere we went. The staff is very helpful. Very understanding and compassionate. The characters are very awesome with the kids and adults with disabilities, we stayed at the Drury Plaza Hotel in Orlando Disney Which we had a good time we",
      "handicap": 1,
      "pet": 0,
      "child": 1
    },
    {
      "review_index": 14,
      "chunk_index": 1,
      "chunk_text": "had a blessed they have shadows to take you to and from all Disney theme parks and yes, it is very accessible for people in wheelchairs. They even ask you if you need the tamp down if they see you have issues with walking, they saw that I was blinding hand mobility issue so they asked if I wanted the wrap down even though I was not in a wheelchair no trouble airport they were very helpful. My daughter had a Great time my oldest had fun with the fast pass cus we didn’t have too wait in long lines lol going off peak season is great cus",
      "handicap": 1,
      "pet": 0,
      "child": 1
    },
    {
      "review_index": 14,
      "chunk_index": 2,
      "chunk_text": "1 less people 2 shorter lines for rides 3 just overall a lot better for people with disabilities, especially if they are autistic",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 15,
      "chunk_index": 0,
      "chunk_text": "What does \"ADA tub\" really mean, when searching on AccessibleGo? I'm asking because my son has ALS and uses a wheelchair, but at home he uses a slide-in shower chair. Otherwise, he would need a roll in shower with a seat.",
      "handicap": 1,
      "pet": 0,
      "child": 1
    },
    {
      "review_index": 16,
      "chunk_index": 0,
      "chunk_text": "I am a paraplegic male—with reasonable upper body strength—looking for suggestions to assist with transfers on and off of a commode in a hotel room during travel. My issue is the commodes are too low, and the grab bar on the wall is too high, both making it hazardous/impossible to get adequate “lift” to transfer on and off of the commode. Have any of you experienced this problem? I’ve thought about getting a 3” raised commode seat that could be used in hotels during travel, but it would be big and cumbersome—plus stability is questionable??? Do you have any other recommended solutions? Thanks for your helpful suggestions!",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 17,
      "chunk_index": 0,
      "chunk_text": "Hi there. Has anyone stayed in Reykjavik and had a hotel which actually met your needs? I am struggling to find a room with toilet grab bars, let alone a decent bed height for transferring. Thank you!",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 18,
      "chunk_index": 0,
      "chunk_text": "Any ideas for this member? In order to fly for a distance my husband needs at least a premium economy class ticket due to back issues. I see that some hotels have adjusted their prices to provide for disability access. Are there any airlines that do this? It is the extra cost of such tickets that limits our travel.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 19,
      "chunk_index": 0,
      "chunk_text": "I want to share info about a trip my husband & I just took to Texas. I have a Pride Baja scooter & several places we wanted to go were accessible for my scooter! We visited the Waco Mammoth National Monument & all the trails & the dig site were easy for me to navigate. Pretty exciting to see actual mammoth bones! We went to Cameron Park & there were many trails for my scooter & my husband’s bike. The bridge over the Brazos River was scooter friendly, too. We spent a couple days in Austin after leaving Waco. We stayed at the Lakeway Resort & Spa on",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 19,
      "chunk_index": 1,
      "chunk_text": "Travis Lake. The room had a lovely view of the Lake & we even saw a doe & 2 fawns in the wilderness below our balcony. The bathroom was spacious & had a low tub with plenty of grab bars & a slide bar for the shower head. The only problem was that the bed was extra high, so somewhat difficult to get up onto. Lots of wide open spaces & a beautiful place. Visited Lady Bird Johnson Wildflower Center. The trails were either cemented or pea gravel. Lots of shady spots to get out of the sun if needed. The gift shop was large & spacious, plenty",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 19,
      "chunk_index": 2,
      "chunk_text": "of room for scooter to navigate. Also hit the Roy & Ann Butler Hike & Bike Trail, a waterfront trail loop around Lady Bird Lake. It was also pavement & pea gravel all around. Hope this helps anyone with TX tourist ideas!💙",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 20,
      "chunk_index": 0,
      "chunk_text": "Join John Morris of WheelchairTravel.org and accessibleGO for a live digital event to share Thanksgiving accessible travel tips & advice. Tuesday, November 14 at 7pm ET here on the Community Forum Plus, as an added bonus, attend for a chance to win a Fall Fun Travel Package! Package includes: 🎁 $250 Southwest Airlines gift card 🎁 $250 Disney gift card 🎁 A hotel booked on accessibleGO, worth up to $200 🎁 30 minute accessibility consultation with accessibleGO RSVP here! https://community.accessiblego.com/c/community-calendar/john-morris-accessiblego",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 21,
      "chunk_index": 0,
      "chunk_text": "Hello: I am thinking about taking a short vacation in the Florida Keys. I would need an accessible room. I also want a room with a patio that has a view of the ocean. Any ideas? Thanks, Cindy",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 22,
      "chunk_index": 0,
      "chunk_text": "Hello Everyone: I was wondering if there are any grants available to apply for that assist with making our homes handicapped accessible and or if there are grants available to purchase mobility equipment like wheelchairs, ramps, motorized chairs, walkers, adjustable base beds etc. there was a chair I saw advertised on Facebook and cannot find it but it helps you in the kitchen when cooking. It was a motorized chair that could lift you above the stove to look in your pots and to reach the cabinets. I am limited by my Walker and always need for someone to pass me things and sometimes my children or grandchildren",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 22,
      "chunk_index": 1,
      "chunk_text": "are not home. I retired from work because of the decline in my mobility. I was declared permanently disabled by SSD but Medicare takes 24 months and my current medical plan does not cover any of these things. I do appreciate any information you can provide. Thank you. Legretha",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 23,
      "chunk_index": 0,
      "chunk_text": "My husband uses a regular wheelchair and has an electric chair. We are flyng to Rapid City, SD in October and are looking to rent a vehicle that has the trailer or lift on the back. We would like to rent a mini-van. Do regular car rentals at airports have these?",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 24,
      "chunk_index": 0,
      "chunk_text": "From a community member: My sister is planning a trip to Nashville and Atlanta. She has a hotel booked but is looking for DMEs where she can rent a hospital bed and portable Hoyer lift. Would you be direct me on the best ways to find companies in those areas? I can google but would love to have a referral of where people have had good results. Thanks so much in advance",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 25,
      "chunk_index": 0,
      "chunk_text": "Do you have any suggestions? I am flying into Miami and I will need a handicap accessible shuttle with a lift to go to a handicap accessible motel. The next day I need the shuttle to take me to the port of Miami for a cruise.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 26,
      "chunk_index": 0,
      "chunk_text": "Got any ideas? hoping you can provide information about small width walkers that can be used in an airplane aisle. my wife has sca-6 and it is quite challenging to maneuver to the restroom on the airplane.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 27,
      "chunk_index": 0,
      "chunk_text": "I am new here but I do not know any organizations to join. I've been wheelchair bound since 2021 and this year was able to get an electric chair. I have multiple things wrong plus have to make several trips to Georgia to help take care of things for my father who has MS and in a veterans home. When I travel it is next to impossible to find hotels with a roll in shower, I am not able to do tubs at all. And if I do find one, the prices are outrageous. I love having the freedom my new chair gives me, but still cannot go",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 27,
      "chunk_index": 1,
      "chunk_text": "anywhere alone since I can't get my chair in and out. I look forward to chatting with people going through similar difficulties. Hope everyone has a great weekend coming up!",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 28,
      "chunk_index": 0,
      "chunk_text": "I have previously posted that bed heights in motels are too low for me. I have been thinking of ways to make them taller, and am wondering about an air bed. One of those tall mattresses that has a pump for inflating. I could put this under the mattress on the bed for extra height.Has anyone tried this? Do you think it would work?",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 29,
      "chunk_index": 0,
      "chunk_text": "Hi, I’m setting up my trip to Northern Europe and looking for ideas about 4-5* hotels near Maastricht and Ghent. I have a spinal cord injury and am a full-time manual chair user. Let me know!",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 30,
      "chunk_index": 0,
      "chunk_text": "From a community member: Is there a way to find out which places have recliners in the room as I’m in a wheelchair and have congestive heart failure. I can’t lay flat have to sleep in a recliner. I’m looking to travel to Gatlinburg/Pigeon Forge TN area in March and looking for an accessible place with recliner. Thank you!",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 31,
      "chunk_index": 0,
      "chunk_text": "My first trip after the amputation 2 years ago then a stroke in Feb 2023 was a solo trip to Bogota, I had never even been out of the country before and had just got my first passport,, I am Glad I chose Alaska and American Airlines, called their disability phone lines, they even moved my seats closer to the front even though they did not show available when I was picking my seats, I told them of my condition and that I was fearful of getting lost in the airports even though I gave myself 3 hour layovers, and living in the mountains most of my life,,",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 31,
      "chunk_index": 1,
      "chunk_text": "they gate checked my chair so it was waiting at the next stop, they escort me to my next gate (via a train - another first) . they helped me thru customs on both ends and helped me transfer my bags and at the destination they got them at baggage claim took them to the hotel shuttle area and waited with me,, they were all Angels in my eyes. That was May 2023, since then I traveled to Texas and back and now less than 2 weeks from leaving to return to Colombia to spend the winter there for 6 months. My advice is get out there and",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 31,
      "chunk_index": 2,
      "chunk_text": "Live and Enjoy yourself",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 32,
      "chunk_index": 0,
      "chunk_text": "My husband watched the 1956 Moby Dick with Gregory Peck and said “Let’s have a Moby Dick weekend in New Bedford” and we did. He is a full-time wheelchair user, only able to use his right side. We have recently “graduated” from Hoyer lift to slide board transfers wheelchair ←> bed, and that makes finding a hotel easier. It was a wonderful trip with no “surprises”. Hotel: Fairfield Inn at Marriott. ADA room with 2 queens. I called the hotel directly 2 days before arrival and Jaz at the front desk was very helpful. She measured top of bed height (24”) which made for a pretty level transfer.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 32,
      "chunk_index": 1,
      "chunk_text": "I explained that getting out of bed would require backing the wheelchair up to the headboard, so any nightstand must be movable. The left-hand bed did not have a nightstand on the left so that worked. I also asked for bathroom grab bars to be on the right, and she double checked that our room had that config. When we arrived, everything was as specified. My husband and I did not need assistance, but I saw our check-in person Mallory helping a couple with mobility issues load their bags on a dolly. Free breakfast was a better than average self-serve. I served my husband, but there was staff",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 32,
      "chunk_index": 2,
      "chunk_text": "refilling food and I bet they would help someone if asked. Activities: Harbor-walk: beautiful, wide 1.5 mile walkway along the water. Made of large concrete sidewalk slabs and the transitions, while pretty good, were still painful for my husband. Whaling museum: A great museum. You could spend a whole day there. Roomy elevators to all floors, even the observation deck. The only thing inaccessible is climbing into the whaling ship model. I took the highlights tour (even though my husband chose not to) and it was also accessible. Fort Tabor: Lots of paved paths around the fort and by the water. Totally smooth sailing. Walking: Historic center roads",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 32,
      "chunk_index": 3,
      "chunk_text": "are cobblestones, uncomfortable even in a car. Sidewalks are slate, which wasn’t too bad, and crosswalks are slate. I managed to find street or lot parking everywhere. I took a guided whaling themed walking tour for an hour while my husband sat on the whaling museum patio, but the walk covered just one city block and we did not enter buildings, so it would have been possible in a wheelchair. Restaurants:All were accessible and people went out of their way to be helpful. Antonio’s: They put out a ramp so the wheelchair could climb the one step to get in. There was room to navigate to a table.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 32,
      "chunk_index": 4,
      "chunk_text": "Tia Maria’s: We ate outdoors at a table. We loved the food and went twice. Lots of authentic Portuguese faire. Indoors would not be accessible. Black Whale: Large parking lot, easy ramp, lots of roomy table choices. Coastal Bubbles Wine Bar: On my walk I saw a lovely deck with the sign “Sip, slurp, Sundays. Oysters $2”. The deck was up a flight of stairs, but the manager showed me that entering at the back of the restaurant was street level. Best oysters of the summer. Lovely fall weather and a great trip. I recommend it.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 33,
      "chunk_index": 0,
      "chunk_text": "I’m flying to Colorado for a MS bike adventure. I have a scooter that folds up nicely. How do I put it on the plane? What do I need to do with the airline? Thanks for any help!",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 34,
      "chunk_index": 0,
      "chunk_text": "Hi Everyone! When it comes to national parks that you love, which parks would you recommend as being the most accessible and why? Asking about parks that are leading the way when it comes to accessible accommodations, tours, walkways, infrastructure, etc?",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 35,
      "chunk_index": 0,
      "chunk_text": "Last week we announced that we've expanded to become the first one stop shop for travelers with disabilities... This includes wheelchair accessible rides! In partnership with Jayride, accessibleGO is offering wheelchair accessible rides, including airport transfers, hotel pickups and general travel services, ensuring customers will have the right vehicle with a reliable service provider with 24/7 support by Jayride’s customer service team. Just fill out the form on our site with the desired rides and the Jayride concierge team will respond within 12 hours Monday-Friday to assist with booking a ride with a wheelchair accessible vehicle. Send request for quote today!",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 36,
      "chunk_index": 0,
      "chunk_text": "Last December, I was chatting with a woman waiting for transportation, and she showed me her WalkMate walker that converted into a wheelchair so I could be pushed when necessary! According to the company, that particular model is no longer available. (Maybe just in the USA?) Question: If you have one, could you let me know the model number? The Walkmate company is in Europe and only sells in the USA via Amazon. If you already have this particular model, is it worth my searching further?!? Thank you!",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 37,
      "chunk_index": 0,
      "chunk_text": "Introduce Yourself! Welcome! Read This First. Hello I’m Melissa Randolph and I have mobility issues and I love to travel but my disability keeps me from doing it as much as I would like. Thank you for having me in the accessible go family. God bless you. Happy Holidays",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 38,
      "chunk_index": 0,
      "chunk_text": "From a community member: I plan to visit Tacoma, WA this fall. I will be staying with my family, but I will need a scooter. I am looking for rental companies. I also want to travel to the National Parks including Yosemite and Yellowstone. I am interested in tours that are accessible. Any suggestions would be helpful.",
      "handicap": 1,
      "pet": 0,
      "child": 1
    },
    {
      "review_index": 39,
      "chunk_index": 0,
      "chunk_text": "Does anyone have suggestions for this member? I am going on a cruise in a couple of weeks. I will be taking my manual wheelchair and a stroller. Does anyone know how I can package my walker basket, cushion and back from my wheelchair. Will this all just go in the overhead bins as carry on luggage?",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 40,
      "chunk_index": 0,
      "chunk_text": "While searching for ADA hotels/motels around Western New York, I came across this. Some do not say whether they are accessible or not, so you have the option to contact the hotel. Well, this looked nice, so I sent them a message. This is their reply: Three of our rooms are handicap accessible. However, we do not have an elevator in the building and the hotel is located on the 2nd floor of a historical building. https://www.booking.com/hotel/us/webber.html?aid=2057903&label=q_and_a_UmFuZG9tSVYkc2RlIyh9YWayva3ct2_1zZ9cbFIiQgdTe96XTJo9kGcISjkgILVfhps7SIq9n8h-A4UAuR1mu3lckxagar5R&sid=1cdb0249e536f302d08c9936cc307c94&breadcrumb=hotel&",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 41,
      "chunk_index": 0,
      "chunk_text": "Hi guys - as a service, accessibleGO is currently focused on American/domestic travel, but I couldn’t resist sharing these very cool international travel opportunity that somebody shared with us recently. If any of you have ever had a safari on your bucket list, this might be a game-changer. 🙂 Ximuwu Lodge is a new, wheelchair-friendly lodge located in South Africa, on the border of Kruger National Park. Their representative describes their offering as: Our lodge, located in the greater kruger, is designed specifically to accommodate guests with mobility challenges, with a range of wheelchair-friendly features throughout the property. Our gameviewer, shuttle bus, bar, spa, photographic hides, boma, and",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 41,
      "chunk_index": 1,
      "chunk_text": "all other amenities are fully accessible, ensuring that guests with mobility challenges can enjoy every aspect of their stay. In addition to being wheelchair-friendly, our lodge is also exclusive use, offering guests a private and luxurious experience that is unmatched in the region. We believe that this combination of accessibility and exclusivity makes our lodge an ideal choice for travelers who are looking for a unique and unforgettable experience. Thought you guys might appreciate! Sounds like an exciting experience.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 42,
      "chunk_index": 0,
      "chunk_text": "I am Que. I have severe osteoarthritis in both hips and my right ankle due to a bizarre accident 50 years ago.I spent a year on crutches, with all my weight on my left leg, then another year using a cane. this was in 1974 and 1975. when the Pandemic started my Y closed and I didn’t keep up with my exercise routine.I have become increasingly disabled over the years, finding various helps when I needed them. I now use one ski walking pole and one Strong Arm. I am looking at getting either an electric wheelchair or a scooter for traveling as I am super slow when",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 42,
      "chunk_index": 1,
      "chunk_text": "walking and my hip starts hurting after walking about a block. I understand from reading these posts that Viator has good accessible tours. are there accessible boat tours? the other times my wife and I have traveled in Europe we have taken boat tours of the canals and rivers but some of them were really hard for me to get to with one cane. I don’t think I could go down the stairs or clamber around a boat now.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 43,
      "chunk_index": 0,
      "chunk_text": "From a Community Member: My family is considering a trip to Italy (2024) for the closing ceremony of the Olympics. We would then travel to a couple other countries. My oldest has Cerebral Palsy and utilizes a power wheelchair. My husband is having second thoughts because of this. Might you have any suggestions and tips to help encourage us? I’m thinking this will be one of her few, or only, opportunities to travel abroad. Thanks for your help!",
      "handicap": 1,
      "pet": 0,
      "child": 1
    },
    {
      "review_index": 44,
      "chunk_index": 0,
      "chunk_text": "Am a below knee amputee with prosthetic leg planning a cruise to the Antarctic. Am over 70 and active only need a walk-in shower in my cabin vs a full ADA cabin. Interested if any recommendations for a cruise line with excursions that I can manage. Will not walk on ice but can ride zodiacs. Like Silver Seas. Any suggestions?",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 45,
      "chunk_index": 0,
      "chunk_text": "I’m just back from a three week, six country vacation in Europe. As a person with a spinal cord injury who cannot stand/walk, the past 35 years of air travel has been extremely frustrating and sometimes physically painful. I always come home saying I never want to stop traveling, but I wish, just once, the air travel would go smoothly. Well this time was oh so close! Nearly as perfect as it could get. I fly United out of O’Hare a number of times per year. In comparing O’Hare against most of the European airports I’ve been through, it has always provided the least attention to me as",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 45,
      "chunk_index": 1,
      "chunk_text": "a wheelchair user. This time, something was different. More special treatment, a specific line at customs, and better trained personnel from the agents to the lift assistants. What, Finally?? It would have been an absolutely mind blowing experience had my chair been at the plane door when I arrived back in Chicago. The agent said I’d have to go to baggage claim to get it. Knowing my rights, I said my chair must be delivered to the door. (Ok, technically “as close to the door as possible”). Funny, within literally seconds, my chair appeared. What? OK. That was it. The attendant wheeled me through the wheelchair line at",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 45,
      "chunk_index": 2,
      "chunk_text": "customs and we were out the door. Just wanted to share. Hope this is the start of a trend. 🤞 For the trip we flew into Amsterdam and out of Zurich. I splurged and hired a driver for the Netherlands and Belgium where we attended the Fomula 1 Dutch Grand Prix practice day and visited a few WWI & II memorial sites. I set up the hotels and sites on my own for this part of the trip. Then we made our way to France where we met some friends and hired the Claire & George Foundation (C&G)based in Bern Switzerland to drive us through Luxembourg, Germany, and",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 45,
      "chunk_index": 3,
      "chunk_text": "Switzerland. C&G provided a driver, set up all accessible hotels, and any attraction and event tickets for us They even arranged a hoyer lift for me to be delivered to our hotels It was a wonderful, stress-free trip that included the Mosel Wine festival and a Champaign region tour I highly recommend C&G. They are easy to work with and can help plan the type of travel you like. Last year they set up a mostly train tour of Switzerland for us. After all the years of setting up my own travel, it was nice to have someone else do the work. Now, if they could only take",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 45,
      "chunk_index": 4,
      "chunk_text": "care of those cobblestones… Happy to share locations and hotels. Just ask. ~Wendy",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 46,
      "chunk_index": 0,
      "chunk_text": "We are looking to rent an accessible cabin for a week in WI or MN or would potentially consider Upper MI. We would like there to be fishing and/ or swimming access nearby preferably outside the cabin itself. Any suggestions would be greatly appreciated. Thanks in advance.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 47,
      "chunk_index": 0,
      "chunk_text": "Trying to find a centrally located accessible hotel in Rome. Any suggestions?",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 48,
      "chunk_index": 0,
      "chunk_text": "I’m a young (in denial) and active senior that has been helping with my ex Mother In Law. She is in a Thrive memory care facility in Columbus, GA. She has mild but progressing dementia and is in a wheelchair due to a stroke taking her left leg. I go visit and/or pick her up from time to time and take her to some place fun. Before her stroke, we were having a ball hitting all of the county and state parks. That girl loves a Road Trip. Our last overnight, hotel experience was extremely inadequate and stressful. I’m so glad I found this site via AARP. Hopefully",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 48,
      "chunk_index": 1,
      "chunk_text": "with this service and your input, she and I can hit the road again (after the heat goes away). Cheers and Sweet Tea for everyone! War Eagle Anna :)",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 49,
      "chunk_index": 0,
      "chunk_text": "From a community member: I am looking to rent a travel power chair for a weekend. Any suggestions where I can rent one? I live in Monmouth County New Jersey.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 50,
      "chunk_index": 0,
      "chunk_text": "Hi Everyone ~ I am so thankful for finding this site. My fiancee is a Quadriplegic in a Power Chair. We live in New Orleans Louisiana and I am looking to take him on our first “trip”. Can yall give me any recommendations or tips where I can find accommodations such as AirBNB, etc? Is there a good website or something that I could look at options in Florida, Tennessee, Arkansas……I have read some of you bring your medical supplies Hoyer lift, Shower Chair, Etc and others have rented equipment. Thank you in advance for all your recommendations and suggestions!",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 51,
      "chunk_index": 0,
      "chunk_text": "Hello everyone! I thought I would do some tips on disability tags and see if that is helpful. Hope everyone is well!",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 52,
      "chunk_index": 0,
      "chunk_text": "Anyone here who flies frequently notice an increase in the number of passengers who are taking advantage the pre-board option? Especially on Southwest?I use wheelchair full time and always need to preboarder and use a aisle chair. If I am flying Southwest I can transfer directly from my chair to a seat in the front rows but only if they are not already occupied. The gate agents are always really good about getting me on first but there is always a line of at least ten other “disabled” people jockeying for position behind me and giving me dirty looks because I get to board first. What’s amazing is",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 52,
      "chunk_index": 1,
      "chunk_text": "that the majority of them are all ambulatory and walk down the jetway without any assistance at all and when we get to our destination pop right up and sprint out the plane.Am I wrong in being totally annoyed with this or is it just my imagination that this seems to be happening more and more. I also fly other airlines that have assigned seats and I never see the number of pre-boarders that I do when I fly Southwest. I understand that there are a lot of peoples who need assistance to get through the terminals to the gates because of the distances involved but to then",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 52,
      "chunk_index": 2,
      "chunk_text": "get preferential seating for no real reason seems wrong to me.",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 53,
      "chunk_index": 0,
      "chunk_text": "I will be in NYC in March for nearly a week and need a budget conscious, accessible hotel for 2 people (myself and my partner) in midtown. Any suggestions would be appreciated!",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 54,
      "chunk_index": 0,
      "chunk_text": "Can I get some recommendations for a nice handicapped accessible hotel in Dublin, Ireland that is very close to nice places to dine also other than just at the hotel itself. The Hampton Inn in Dublin is nice and handicapped accessible but is very limited on nearby dining other than at the hotel. Thank you for your help.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 55,
      "chunk_index": 0,
      "chunk_text": "Has anyone had a problem with a group tour company refusing to let you bring a scooter with you? I have a light weight foldable scooter that I need to take, but the travel company I wanted to book with said they would not allow any motorized aids. Only fold up walkers were allowed.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 56,
      "chunk_index": 0,
      "chunk_text": "The website won’t let users filter for necessities like roll-in shower, transfer bench/shower chair, or other amenities like fridge for meds. This makes shopping for accommodations more difficult for members",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 57,
      "chunk_index": 0,
      "chunk_text": "Last spring my mother and I traveled to Austria and Italy and took her new ATTO mobility scooter. It was fabulous. The scooter is FAA approved so you can take it on most airlines. It folds to the size of a carryon suitcase and has a travel cover (suit of armour) to protect it from harm. Assembly/disassembly takes about 1-2 minutes and it is VERY sturdy. Without ATTO Mom wouldn’t have been able to travel. Very highly recommended! You can find info about it at https://www.movinglife.com/. This is NOT an ad. I just really love this scooter and, as my own disability gets worse, I’m sure I will",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 57,
      "chunk_index": 1,
      "chunk_text": "use it, too.",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 58,
      "chunk_index": 0,
      "chunk_text": "*NEW* Traveling With Deme Many patients travel or would like to travel. This show gives an exclusive view inside of some of the top rated hotels around the United States. Are they really accessible? What amenities do they offer? This show shows you all that and more so check it out!! https://youtu.be/JzjIoRy_cGM?si=gZjbq-GWiuc1wLnc",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 59,
      "chunk_index": 0,
      "chunk_text": "I am a caregiver for a female full time wheel chair user. We are traveling to Scotland and renting a van for two weeks. The company does not offer insurance to cover tires window damage for WAV Does any one know of a reputable company that offers that type of insurance coverage?",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 60,
      "chunk_index": 0,
      "chunk_text": "What companies have you found to be good for renting a Hoyer (any brand) lift to be delivered to hotel? My travel lift has 8” wheels and even hotels with room under beds rarely have 8”. I’m currently looking at Silver Spring MD, but plan to drive south for the winter. I found Cloud of Goods. Has anyone used them? Any other companies to recommend? Thanks.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 61,
      "chunk_index": 0,
      "chunk_text": "Title: From Healthcare to Travel—Still Supporting the Disability Community 💙 Hi everyone! My name is Laurel Grant, and I’m thrilled to be part of this amazing community. For over 25 years, I worked in the health field supporting individuals with disabilities. That experience shaped my heart and my purpose and it continues to guide me today. Now, I’ve transitioned into a new chapter as a travel advisor , specializing in accessible vacations, group travel, and destination weddings. I’m passionate about helping people with disabilities explore the world with confidence, comfort, and joy. I’d love to stay connected with this community and continue being a resource for accessible travel.",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 61,
      "chunk_index": 1,
      "chunk_text": "If you ever need help planning a trip or just want to chat about travel ideas, I’m here! 📧 laurel.grant@onvigo.com 🌐 laurel.grant.onvigo.com 📞 1-866-341-5475 ext. 7844 Looking forward to learning from all of you and sharing what I can. 🌍✈️ Warmly, Laurel",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 62,
      "chunk_index": 0,
      "chunk_text": "While visiting Washington DC in September, we rented a mobility scooter from Orthopaedic Mobility Services. I dealt with Jorge Manzano who was very helpful. Scooter was at our hotel when we arrived, texted pictures of how to operate, and reasonable price. It was only our second time renting a scooter, and it was a pleasure to do business with them",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 63,
      "chunk_index": 0,
      "chunk_text": "We are starting to finalize the details on our big trip to Europe in 2024/2025. So far I have: Hotel in Miami 2 nights - citizenM within walking to cruise port. Cruise from Miami to Southampton, UK 14 days Hotel in London, Covent Garden 3 nights-near theater area which are accessible Hotel Cologne, Germany 7 days- subway elevator outside front door. Hotel Prague, Czech Republic 7 days-central to everything Hotel Krakow, Poland 7 days- newer hotel with elevator Hotel Munich, Germany 7 days- central, newer Hotel Interlaken, Switzerland 7 days- Christmas in the Alps 9.———And this is where I have hit a dead end. We need to stop",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 63,
      "chunk_index": 1,
      "chunk_text": "in Milan for a couple of days. But we want to go somewhere warmer but cheapish. Has anyone been in southern Europe and have some suggestions? We will have 4 more weeks to fill. I hope to stop in Paris for a few days before we board our cruise home.",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 64,
      "chunk_index": 0,
      "chunk_text": "Hi all. My son is 17 and gets around in a manual wheelchair. Is there an inexpensive country that has decent wheelchair access? I realize I may be asking for a unicorn, but I am looking at Central America, and SE Asia (Malaysia, Indonesia, maybe Thailand). Honestly, if there were an airbnb/rental that had a handicapped accessible bathroom, and in a city/town with sidewalks, that would work. He can transfer into a regular car if it is a 4 door. Toying with the idea of staying for 2-3 months. But it may be a pipe dream.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 65,
      "chunk_index": 0,
      "chunk_text": "I'm headed to London on September 19 and I'm trying to rent a mobility scooter for 3 days. So far I'm not having any luck. Would you know where I could find one to rent? Do you have suggestions for this member? Chime in below!",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 66,
      "chunk_index": 0,
      "chunk_text": "Hi everyone! I’m travelling to Orlando at the end of the month and I’m wondering if I need to specifically book a wheelchair taxi for pick up at MCO (Orlando) to take us to our hotel, or if they are readily available from the airport? I mainly fly into Vancouver, Canada (YVR) and the wheelchair taxis are so plentiful there that i think they are that way everywhere. I flew into Las Vegas (LAS) thinking that it was one of the most accessible places to vacation, which it was, but the availability of wheelchair taxis was a joke. It definitely lowered my opinion for accessibility for Vegas. So",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 66,
      "chunk_index": 1,
      "chunk_text": "now I’m wondering about Orlando. Can anybody give me some insight?",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 67,
      "chunk_index": 0,
      "chunk_text": "Do you have suggestions for this community member? My husband booked RC Mariner of the Seas for April (out of Port Canaveral, FL). The few times we've cruised, my husband won't get off at any ports because of me and my scooter...and the dangers amiss. We are stopping only in Cozumel. Can you guide me? Can I even go?",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 68,
      "chunk_index": 0,
      "chunk_text": "We will docking in Philipsburg, St. Maarten and according to my information it is a 20 minute walk from the port to the town. My husband cannot walk that far, I travel with a Pride scooter, any suggestion for accessible taxis would be appreciated/ Thank you. Mickey",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 69,
      "chunk_index": 0,
      "chunk_text": "I would prefer to write a complete review of this hotel after my stay, but my experience with Hyatt while trying to make reservations has been nothing less than miserable. My husband and I are planning to attend a conference in July 2024 that will be held at the Hyatt Buffalo. After registering for the conference, I followed the instructions on the conference website and attempted to make reservations for two rooms at the special conference rate. I reserved both an accessible room with a roll-in shower for my husband and myself (an amputee and wheelchair user) and a standard room for my aide. While I had no",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 69,
      "chunk_index": 1,
      "chunk_text": "problem making a reservation for my aide at the conference rate, I was told by the Hyatt reservation agent that I would be charged nearly double for the accessible room because there were no accessible rooms within the conference room block. I contacted one of the conference planners to request assistance in getting both rooms at the conference rate. During the contract process, he explained, the conference planners were told by Hyatt sales staff it was impossible to contract for accessible rooms as they needed to be made available to all Hyatt customers. While this is a nice thought, it is just not true. This conference, and others",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 69,
      "chunk_index": 2,
      "chunk_text": "like it are held annually. It is the custom of the meeting planners to make sure that there are accessible rooms available within the room block as there is a large percentage of individuals with disabilities who attend the conference, and they require accessible rooms. Attendees of this conference in previous years are surveyed about their need for accessible rooms so the planners can ensure that an appropriate number of rooms are available in subsequent years. I contacted Hyatt Global Customer Care Center. I was told I could not have an accessible room at the conference rate as the room block was sold out. So why could I",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 69,
      "chunk_index": 3,
      "chunk_text": "confirm a standard room for my aide at the conference rate? The practice of charging one rate for a standard room and a higher rate for an accessible room is blatant discrimination, and a violation of the Americans With Disabilities Act and, I imagine, any number of state and federal laws designed to enhance interstate commerce and to prevent similar acts of prejudice. Hyatt Hotels should be ashamed.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 70,
      "chunk_index": 0,
      "chunk_text": "I will be traveling to Las Vegas in March 2021. I will need to rent either a scooter or power chair for the week I’m there. I’m looking for something relatively lightweight and foldable. I know there are a lot of both scooters and power chairs out there - in fact, I’m overwhelmed by the number of them. Can anyone recommend one that we can simply fold up and put into a rental car? We don’t want to have to disassemble and reassemble every time we take the car out. Thank you.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 71,
      "chunk_index": 0,
      "chunk_text": "I recently flew from Eugene Oregon to Seattle Washington on an Embraer ERJ 175 Alaska Airline in which I made reservations months in advance. Three days before I traveled I received a call confirming my power wheelchair and that it was to be gate checked and put in the only slot on the airline for power wheelchairs. Upon arrival at the airport, after checking in for my flight, I was told that my power wheelchair, which is 36 inches in total height, was too tall to fit on the aircraft. I have a tilt function, which I tilted back so that the hand grips were no higher than",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 71,
      "chunk_index": 1,
      "chunk_text": "33 inches, and was told that this was sufficient to fit on the aircraft. After we boarded and the plane was ready to take off, the cargo personnel came on the airplane to tell me that my power wheelchair would not fit on the airplane. I was told I had two options, one was to continue on with this flight and my power wheelchair would arrive with any luck later that evening as my destination was Washington DC and my second choice was I could be taken off the airplane yet there were no other flights out that day and they could not confirm there was even one",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 71,
      "chunk_index": 2,
      "chunk_text": "the next day that could get us to Washington DC. I continue on with our travels and made it to Washington DC on the flights that we had reserved months in advance, and my power wheelchair arrived the next day at 11 AM. On return flight we have the similar plane from Seattle to Eugene and experienced the same problem, only this time my power wheelchair did not arrive at my home until a day and a half later. The bottom line is make sure that you do not fly with a power wheelchair that has a total height no greater than 33 inches on an Embraer ERJ",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 71,
      "chunk_index": 3,
      "chunk_text": "175 aircraft. Alaska airline I’m sure it’s not the only airline that utilizes this style of airplane. So please do your homework so you do not experience the same headaches and disruption to your vacation that we did.",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 72,
      "chunk_index": 0,
      "chunk_text": "We have a member interested in traveling to Fort Walton, Destin, or Pensacola. They want a hotel near the beach that is highly recommended in terms of accessibility. They need a roll-in shower with no lip that has a shower chair and a handheld shower sprayer. They truly would like to find a hotel that has a zero entry pool so that they can enter it using their walker. In the event that a zero entry pool is not available, they would like to have an accessible chair lift for the pool. Any suggestions? Drop them here.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 73,
      "chunk_index": 0,
      "chunk_text": "Hey everyone, it’s Patch from accessibleGO. I’m working with a member who is trying to book a hotel room in Tokyo that has a roll-in shower. They have only been able to find bathtubs. Does anybody have suggestions for them? Thanks!Patch This community forum is the heart of accessibleGO, a hotel booking site for travelers with disabilities. Our mission is to make sure travel is accessible and easy for all. Book your next trip with us.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 74,
      "chunk_index": 0,
      "chunk_text": "This is a big ask, but I can dream. My daughter’s family of 4 is in DC suburbs. My husband in a wheelchair full-time and I live in western MA. We’d like to spend Thanksgiving together somewhere that no one cooks and we can all be together. Best would be on the coast somewhere at either end or in between, in lodging with minimal thresholds and 8” under our bed for a lift, and nearby beach with beach wheelchair. Acceptable would be an accessible hotel somewhere in between with 8” under bed in an interesting enough place that we could “stroll” around and eat in restaurants. The fall",
      "handicap": 1,
      "pet": 0,
      "child": 1
    },
    {
      "review_index": 74,
      "chunk_index": 1,
      "chunk_text": "back will be to have them drive all the way to our accessible home and go out to dinner but the other options would be fun.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 75,
      "chunk_index": 0,
      "chunk_text": "Hi, I'm Pam, a proud Disney Adult! I completed an internship at Walt Disney World through Disney University, worked there for a few years, and am now a religious vlog watcher and travel agent! You would think that I would've known all that there is to know about Walt Disney World with that resume, but it wasn't until I traveled with family and friends with disabilities that I learned first-hand about accessible travel. To me, being a true ally to the disabled community is learning from their lived experiences, so I am grateful that I now have this knowledge to pass on along with all of my other",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 75,
      "chunk_index": 1,
      "chunk_text": "tips and tricks! Walt Disney World is beloved for many reasons, and one of those is its vast options of accessible activities. I recommend reading the descriptions of the rides online ahead of time to see which ones not only seem accessible for you, but are experiences that you would enjoy! Some rides you can stay in a power wheelchair, while others require a transfer. Some rides have specific seats for those needing to transfer. One example is the brand new Tron ride at Magic Kingdom. The standard seat looks similar to a motorcycle, but there is a \"caboose\" in the back that is an accessible seat. If",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 75,
      "chunk_index": 2,
      "chunk_text": "you are capable of transferring, one thing that I learned is that when the cast members (workers) ask \"can you transfer?\" first ask \"what are my options?\" One example for this is the Jungle Cruise ride in Magic Kingdom. My friend said that she could transfer and she did. The steepness of the stairs getting into and out of the ride were more steep than she thought. My daughter and I ended up helping her quite a bit, which we were happy to do, but we found out after that there was an accessible boat where she could have stayed in a wheelchair! Another great option is the",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 75,
      "chunk_index": 3,
      "chunk_text": "Disability Access Pass (DAS) which is intended for guests who have difficulty tolerating extended waits in a conventional queue environment due to a disability. This pass allows guests to request a return time for a specific experience that is comparable to the current standby wait. This feature permits guests using the DAS to enjoy other experiences in the park instead of physically waiting in the standby line. Guests can register in person or pre-register via live video call (the guest with a disability must be present) and use DAS Advance pre-arrival planning. It is most convenient to use the DAS on the My Disney Experience app which is",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 75,
      "chunk_index": 4,
      "chunk_text": "available for smart phones. This app has so many great features. Besides the DAS, two that are very helpful are the listed updated wait times and the ability to pre-order quick service food. Speaking of planning ahead, while there are wheelchairs and mobility scooters available to rent (for a fee) at the parks, it is much more economical and efficient to rent through an outside company. When mobility aids are rented through the park, they have to stay in the park. Renting through an outside company allows you to take the wheelchair or scooter anywhere. Some of the resorts at Walt Disney World are huge, so the walk",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 75,
      "chunk_index": 5,
      "chunk_text": "from the hotel to the bus could be very exhausting. A company called Scooterbug is the exclusive provider of mobility devices for Walt Disney World. This distinction is important because they can drop off the scooter at your resort without you being present. With the possibility of flight delays or other mishaps, this service offers great peace of mind. One thing that we learned when asking the front desk for my friend's scooter: if you book through an agent, the device could possibly be under their name. Mobility devices and scooters aren't the only pieces of equipment available for rent (from other companies - Scooterbug only offers wheelchairs,",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 75,
      "chunk_index": 6,
      "chunk_text": "scooters, and strollers). One example for this is that my friend rented an IV pole for her feeding tube. While enjoying is priority number one, it is also a good idea to know the medical services available ahead of time just in case. AdventHealth is the official healthcare provider of Walt Disney World. They have medical equipment for rent, urgent care services, virtual appointments available 24/7, in-park first aid, and a new full-service emergency room minutes from Walt Disney World. While we never like to think about these things happening on vacation, knowing that these services are conveniently available and accessible provides peace of mind when travelling. Walt",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 75,
      "chunk_index": 7,
      "chunk_text": "Disney World has accessible room options in all of their hotels. It is important to think about what you need ahead of time so that questions can be asked before booking the room. Some of these questions are the height of the bed and whether you need a powered door to get in and out of the room. Only you know what you need best! Working with a travel agent who has experience in accessible travel can also help you to brainstorm some questions specific to your needs. I could talk about Walt Disney World all day long! If you have any questions, let them in the comments",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 75,
      "chunk_index": 8,
      "chunk_text": "below and I’m happy to answer. You can also search and book on accessible GO today!",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 76,
      "chunk_index": 0,
      "chunk_text": "My name is Danielle and I am a disabled content creator. My channels are called “Daniellevates” because the content is all about elevating ideas about disability and rare disease. Full-length vlogs feature accessibility reviews from my adventures in Boston and beyond.Short form content consists of series such as Breaking the 4th Wall of Disability, Accessible Design in the Wild, and more! Since birth, I have had an extremely rare technically undiagnosed neuromuscular disease. You can watch & subscribe to me here . This vlog is part two of a day trip from Boston to New York City, and the purpose of the trip was to see \"Into the",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 76,
      "chunk_index": 1,
      "chunk_text": "Woods\" on Broadway! This vlog takes us from the outside of the St. James Theatre and to our seats. I now have my own mobility scooter, but during this trip I used a transport chair that I borrowed from my local senior center. While there are many aspects to having a disability that make life more difficult, we have to utilize the advantages when they come our way! Case in point: you can see our group receive the VIP treatment and skip the line to get into the theater safely. I was very pleasantly surprised by the proactive nature of the St. James Theatre. I selected an ADA",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 76,
      "chunk_index": 2,
      "chunk_text": "seat for myself and an ADA companion seat for my friend, and they emailed me the night before to see if I would like to transfer into one of their seats or stay in my chair. When I indicated that I would be transferring, they said that they would store my chair and bring it back at intermission or anytime that I needed it. I would say that this email is not usual, so definitely plan ahead and ask any questions that you have ahead of time. For someone like myself, sitting in an ADA seat is a must. While I can do stairs with railings, they are",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 76,
      "chunk_index": 3,
      "chunk_text": "draining and I am dependent on them having railings and not being too steep. Additionally, in an emergency, I would likely be one of the last ones out of the building anyways, so adding stairs as an obstacle is not a good idea. The show was amazing, and the rest of the video shows us dining in Times Square, our Amtrak train ride home (spoiler alert: half of us missed the train!), a recap of the trip and an awkward bathroom mishap, and a celebrity cameo from two comedy legends! Broadway lived up to the hype, and our little day trip was definitely chock-full of New York Moments.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 76,
      "chunk_index": 4,
      "chunk_text": "Key Takeaways If you need ADA seating for your health and safety, don't overthink it. Utilize these seats! Think of possible situations ahead of time (seating, bathroom, entering and exiting) and contact the theater with any questions. I should not have waited for them to contact me - this is a rare phenomenon in my experience! If a situation comes up that you didn't think of (like me wanting to get to my seat safely from the dense crowd), don't be afraid to ask for assistance. New York City is crowded. The streets aren't in good condition (I highlight this in part 1 of the NYC Vlogs). Plan",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 76,
      "chunk_index": 5,
      "chunk_text": "ahead for what mobility aid you might need in these conditions. Make a list weeks before the show of what equipment and supplies that you will need. Add to this list whenever you think of something and pack your bag at least one day before. Once the show starts, be in the moment and enjoy! With all the traveling and hustle and bustle to just get to your seat, it can be hard to unwind. Let yourself take in your surroundings and immerse yourself in the show.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 77,
      "chunk_index": 0,
      "chunk_text": "Hello All, my name is Sarah, and I am a multiple sclerosis survivor, mom, army military vet, and Paralyzed Veterans of America board member, so my hands are full. I love to ride my trike because multiple sclerosis is a move-it-or-lose disease, and I refuse to lose anything to the stinky disease. 15 years is long enough to know that MS is a one-star disease that should not be recommended to anybody, but my little boys are my world. I do anything for them, so I do everything I can for them, including camping and hiking and biking, and Team Mom-ing every sport they play. I strive to",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 77,
      "chunk_index": 1,
      "chunk_text": "keep walking and dream of running again someday with the help of CIONIC sleeves (https://cionic.com/). The VA is putting on both my legs. With all the snow this year, I plan on celebrating my 40th birthday in Mammoth Mountain, learning to sit-ski as I used to be an avid snowboarder before my diagnosis in ‘09.",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 78,
      "chunk_index": 0,
      "chunk_text": "Planning an accessible trip to the UK or Ireland can feel overwhelming. Let Altogether Travel, the UK's #1 accessible travel company, take the stress out of the process. We specialize in creating personalized itineraries for travelers with disabilities, and we've helped many Americans and Canadians enjoy unforgettable vacations. Even US and Canadian travel agents rely on our expertise. As a Scotland-based company, we have the inside track on accessibility throughout the UK and Ireland. Contact us today for a worry-free 2025 vacation! Or check out our free accessible city guides for Edinburgh, Glasgow, Liverpool, Dublin & London.",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 79,
      "chunk_index": 0,
      "chunk_text": "Any suggestions? We have a 16 year old son with cerebral palsy and we love to travel. Would love to get some ideas of locations. We live in NH and like to go to the beach/ somewhere warm.",
      "handicap": 1,
      "pet": 0,
      "child": 1
    },
    {
      "review_index": 80,
      "chunk_index": 0,
      "chunk_text": "Hi, I’m a 76 year old woman who had a stroke two years ago, leaving my left side paralyzed. I van walk small distances with my leg brace and cane, but have almost no use of my left arm. I am now widowed, and would like to travel. I love small ship cruises. Any recommendations? Thanks so much.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 81,
      "chunk_index": 0,
      "chunk_text": "From a community member: Hello, In my opinion, one of the most important problems in traveling for people with reduced mobility is the showers in the hotels. People who are paralyzed in the lower limbs, encounter very serious problems with showers that are not suitable for people who are paralyzed and cannot stand without aids. I would love to know about solutions that this community uses.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 82,
      "chunk_index": 0,
      "chunk_text": "I just completed a very enjoyable cruise with my family from Anchorage to Vancouver but I must complain about their airline assistance department. I booked 3 staterooms including a suite for my son’s family and a cabin for my medical aide. We decided to let NCL provide air arrangements, transfer and overnight stay at the Anchorage Hilton for myself, my wife and my aide. The handicapped rooms with roll in shower do not have hand showers! The travel department put my aide on a separate flight from mine for the return journey. I called to change this and was told “because she did not have the same booking",
      "handicap": 1,
      "pet": 0,
      "child": 1
    },
    {
      "review_index": 82,
      "chunk_index": 1,
      "chunk_text": "number as my itinerary there was nothing that they could do until 10 days before the travel date” even though I said it was not possible for me to travel without my aide! I tried, unsuccessfully, to resolve this sooner but finally 10 days before the flight, the resolution department agreed to put her on my flight at an additional cost of $480 which I reluctantly agreed to. I then contacted Alaska Air handicapped assistance to have my seat move nearer the front of the plane since I require an aisle chair. There I was told I should never have been put on the Vancouver to Seattle leg",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 82,
      "chunk_index": 2,
      "chunk_text": "of the trip because it was in Embraer 160 plane which is not allowed to carry lithium batteries even in the main cabin. I called NCL travel resolution who said I should have known that it’s on their website but I pointed out that depending on how you query the mobility section of your website you may or may not be shown the warnings about the Embraer planes. They then rerouted us via Air Canada to our Newark destination. I asked him for my $480 back but they refused.",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 83,
      "chunk_index": 0,
      "chunk_text": "It’s new digital travel magazine targeted exclusively for travelers with disabilities. This issue includes travel experiences from 42 different bloggers, vloggers, youtubers, and Instagrammers. Joomag Accessible Journeys magazine June 2022 ARTICLES: Autism + travel; Autism Adventures Abroad's California experience; Wheel the World - making the impossible, possible; accessible destinations; IZ Adaptive Clothing; The Alinker - a vehicle for change; Visit Ecuador & Galapagos on a...",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 84,
      "chunk_index": 0,
      "chunk_text": "I really appreciated this candid and loving conversation about traveling with a child who has autism: https://news.delta.com/accessibility-travel-customer-shares-perspective-traveling-autism When we travel, we encounter so many strangers - and this is such a nice reminder that you just never know somebody’s story and to be kind and patient, as much as you can. I particularly liked this exchange (from the piece linked above) with some practical tips on how to make travel easier: “Allison: Accessibility in travel has come a long way, but we know there is still work to be done. From your perspective, what improvements could Delta and the industry make to our processes that would help your",
      "handicap": 1,
      "pet": 0,
      "child": 1
    },
    {
      "review_index": 84,
      "chunk_index": 1,
      "chunk_text": "family? Donna: I was once on a flight with a woman who discreetly handed out notecards to customers that said she had an autistic child with her and to please be patient. I thought it was such a great idea. I know customers can work with Reservations and Airport Customer Service to ensure crews are notified of someone traveling with an invisible disability who may need additional assistance before boarding – I think others would benefit from knowing that too. [I’ve often thought that] having a pin or lanyard on for employees who have some experience with autism would be a massive help. It would also serve as",
      "handicap": 1,
      "pet": 0,
      "child": 1
    },
    {
      "review_index": 84,
      "chunk_index": 2,
      "chunk_text": "an identifier for customers. I can sit here and tell you all about what to do, but when you have someone who’s lived it and understands it, that makes a big difference.”",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 85,
      "chunk_index": 0,
      "chunk_text": "TRAVELING TO VIENNA Hi I’m from Quito Ecuador Someone know we’re can I hire a Scooter in Vienna and a tour company with special transportation for the scooter Thanks in advance",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 86,
      "chunk_index": 0,
      "chunk_text": "We have put together a day by day diary of experiences of travelling through New South Wales, Victoria and South Australia, with a family member having a high level of mobility and medical needs. These have now been consolidated into an article which includes the planning aspects and some of the challenges which had to be overcome. It can be found by clicking this link https://www.enablemytrip.com/.../australia-road-trip-in-a... which is the introduction, or by clicking here https://www.enablemytrip.com/.../Australia-by-Wheelchair... which shows the full detail and includes the stopover in South Korea. We hope that if you are planning a trip like this and don't know where to start, it will be helpful!",
      "handicap": 1,
      "pet": 0,
      "child": 1
    },
    {
      "review_index": 87,
      "chunk_index": 0,
      "chunk_text": "We’ve been trying to rent an accessible beach home and I came across this amazing nonprofit-a few things: you can request one of their floating wheelchairs as a family (For a day/week/extended vacation) here: https://smilemass.org/request-adapted-equipment/ list of new england beaches that have their chairs: https://smilemass.org/initiative/beach-wheelchairs/ and map here: https://www.google.com/maps/d/u/0/viewer?mid=11sjOQqOCx4A_zoqpaTzASfqPOyJuoE-D&ll=42.5125589880561%2C-71.68053459999999&z=7 Update-they look to also rent other adapative equipment/mobility tools like hoyer lifts, ramps, shower chairs etc here: https://smilemass.org/initiative/equipment-loaner-program/ your new england town beach can get one of their chairs! - here: https://smilemass.org/smile-mass-floating-beach-wheelchair-award/ you can rent their fully accessible beautiful looking literally right on the beach vacation home here: vrbo looks booked out (wonder if they book out like a",
      "handicap": 1,
      "pet": 0,
      "child": 1
    },
    {
      "review_index": 87,
      "chunk_index": 1,
      "chunk_text": "year in advance)-we need so many more groups and options like this-for folks wanting a home rental versus hotel: https://smilemass.org/initiative/beach-house/ and https://www.vrbo.com/4982108ha?unitId=6200951 Update: Smile Mass partners with a family to rent out a second vacation rental from a SmileMass family (great initiative-again, should be a searchable home rental program :) ) in Lincoln, NH if anyone is interested: https://smilemass.org/initiative/new-hampshire-condo/ and sign up form: https://form.jotform.com/232824236035148 They also mention an accessible ski program on the Lincoln, NH webpage called NEDS I found this nonprofit when search for Mobi-mats (beach mats)-we really need a list of all beaches that have these-and found the floating chairs and then the smile mass nonprofit-so",
      "handicap": 1,
      "pet": 0,
      "child": 1
    },
    {
      "review_index": 87,
      "chunk_index": 2,
      "chunk_text": "great! SmileMass has a great website ( https://smilemass.org/ ) with other programs, including a whole accessible local Club Smile Mass program/Community Within A Community they are currently creating in MA if of interest: https://smilemass.org/capital-campaign/",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 88,
      "chunk_index": 0,
      "chunk_text": "This will be my first time traveling with my personal scooter. Is there anything that I should be aware of, when traveling by plane? Are there guidelines at the airport? Thank you.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 89,
      "chunk_index": 0,
      "chunk_text": "Considering train, which is the least expensive and fastest option, but am traveling with my wife and collectively we have 5 pieces of luggage. Experience w/ Italian/french train stations previously proved that local station staff and will facilitate boarding and seating, but space is very limited for baggage storage (above the seat space is nominal, and end of train car where there is a small open area for all passengers to place their baggage is small); security for baggage is non-existent unless you are literally standing on top of your property. Theft is too frequent to ignore this problem. If we were traveling light, I would have no",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 89,
      "chunk_index": 1,
      "chunk_text": "problem with the train option. So what other options are there? Anyone know? I can fly (this involves, taxi to airport - plane - taxi to hotel + $$ + time) or hire a driver which appears to amount to $800+ one-way. Lastly, rent a car (I am not in wheelchair, but driving in Italian cities for a 78 yr. old is not optimal). Any suggestions would be appreciated. Recommendations of a driver or service more economical?",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 90,
      "chunk_index": 0,
      "chunk_text": "If anyone is a paraplegic or has other problems that prevent them from using their legs, I can recommend a hand cycle tour of The Netherlands. I did it this summer for 9 days with my wife pulling a “buggy” behind her bike that held my wheelchair. We used Holland Bike Tours led by Emiel Blok. You can find his website at this link: hollandbiketours.com Emiel put together a custom tour for us and had our luggage delivered to our next destination each day. It was a great trip. All the hotels and B&Bs were very wheelchair friendly. Attached is a few picture of us on the trip.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 91,
      "chunk_index": 0,
      "chunk_text": "Good morning to everyone. Hope you enjoyed the holiday on Sunday no matter your religion.I am looking for help on a handicap tour or excursions in Nassau, Bahamas in July. I am on a mobility scooter and taking my 15 year old grandson on a cruise with about 6 hours in Nassau. Does anyone know something that can accommodate me on my scooter? Thank you and have a wonderful week.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 92,
      "chunk_index": 0,
      "chunk_text": "Hey everyone, We’re doing ** another ** giveaway. 🙂 This time, we’ve linked up with Accessible Journeys magazine to give away a two night stay at The Schoolhouse Hotel, a super accessibility-friendly hotel in White Sulphur Springs, West Virginia. Details on how to enter here. A little about the hotel, from their website: “Here at The Schoolhouse Hotel we are dedicated to providing excellent service to all of our guests, especially our guests with disabilities. During the design phase of our hotel, we took great strides in making sure all persons will have access to the hotel and its restaurants and amenities.” You can also check out the",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 92,
      "chunk_index": 1,
      "chunk_text": "hotel’s features and accessibility features on accessibleGO. Happy giveaway! Fingers crossed.",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 93,
      "chunk_index": 0,
      "chunk_text": "My question here…is anyone familiar with House sitting services that offer ADA or wheelchair accessibility? I am a full-time caregiver for my mother who uses a walker and wheelchair for all movement. I would love to find solutions for traveling with her that don’t involve all of the money of staying in hotels, especially for long-term stays. As an able bodied person, there are many sites that offer free stays for watching their home, pets, gardens, farms, etc. Some require work in exchange for the stay. However, I have come up blank trying to find any kind of network that caters to people who have accessibility needs outside",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 93,
      "chunk_index": 1,
      "chunk_text": "of contacting each specific home individually and then the odds are slim that they have grab bars installed and all of the other accessibility features. Maybe it is a new network that could be created? Would love any thoughts on this. Thanks - Lisa",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 94,
      "chunk_index": 0,
      "chunk_text": "From a member of our community: We’re looking to travel to Prague this September 2023, with my parents and my children. My father is able to walk, but would need a wheelchair for long distances. It is extremely difficult for him to negotiate stairs. Any recommendations for hotels, attractions, ground transportation that are accessible would be greatly appreciated! Tour operators as well. Thanks in advance!",
      "handicap": 1,
      "pet": 0,
      "child": 1
    },
    {
      "review_index": 95,
      "chunk_index": 0,
      "chunk_text": "I will have a couple of days on my own in Osaka. Anyone know of a travel guide I could hire or day tour? Is the Metro really accessible? I have a travel scooter and can walk a couple of blocks. ??",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 96,
      "chunk_index": 0,
      "chunk_text": "I have MS with spasticity and drop foot on the right. I have a new high tech rollator that weighs just 13 lbs. I'm concerned about trying to travel with this rollator. It does collapse and is fairly narrow. I do NOT want to put it in cargo.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 97,
      "chunk_index": 0,
      "chunk_text": "Anyone here ever been diagnosed with a handicap to later find out you have a totally different handicap which alters your treatment plan, which in turn alters your travel plan (s)?",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 98,
      "chunk_index": 0,
      "chunk_text": "looking for a hotel close to Smithsonian, monuments and the capital (within walking distance or close by public transit). Must have roll in shower and prefer some type of breakfast or kitchenette in room. Any information would be greatly appreciated…",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 99,
      "chunk_index": 0,
      "chunk_text": "We recently got a Class A (the big one) RV, and we are using a motorcycle ramp, at the entrance to mitigate the stairs. This was a temporary solution, and off we went to the Tampa RV show. Only to find out, there is no such “known” companies who place ramps in RV, post manufacturer. I found one company that does a “drop in place” raising platform. You’d always need a second able-bodied person to travel with you, to place the platform. Anyone know of a permanent system, we can buy and place, or have installed? We could make a plan to travel to ADA ramp manufacturer to",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 99,
      "chunk_index": 1,
      "chunk_text": "have one placed, if that is known. Appreciate any feedback to solve this problem.",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 100,
      "chunk_index": 0,
      "chunk_text": "We will be arriving at the Orlando airport on March 7th 2020 and we need transportation from the airport to hotels near the Port Canaveral cruise port. Since I travel with a scooter I need transportation with a lift. There will be 4 of us traveling together. Any and all suggestion will be appreciated. Thank you,Mickey",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 101,
      "chunk_index": 0,
      "chunk_text": "Hi AccessibleGo Fam, My wife, Michelle and I are planning a trip to Washington, D. C. in 2023. At first, she was trepidacious about my having to travel with my wheelchair. I had to prove to her it could be done. So, I flew by myself to see our daughter get her undergrad degree in education. It was a blast! Anywho, my wife has now started experiencing some mobility challenges as well, but she has not fully transferred to the use of a mobility device. So, here are some of the things I am asking this community for some assistance with. Electric scooter rental in Washington, D. C.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 101,
      "chunk_index": 1,
      "chunk_text": "Accessible hotels with shower chairs. Accessible travel packages to D. C. Accessible tour guides in D. C.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 102,
      "chunk_index": 0,
      "chunk_text": "Hello, my son, SCI T3 complete, is moving to the West Orange NJ area for a participation in research study. He’ll need an accessible apartment. Any idea how to do this when we are not local? Thanks, Maria",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 103,
      "chunk_index": 0,
      "chunk_text": "Just remember while in US the vendor must meet ADA requirements as to accessibility and you as a disabled traveler are entitled to things like accessible bathrooms, hotels, restaurants, attractions such as Disney. BUT, once you leave the geographical boundaries of US, you are no longer pritecby ADA. BEST ADVICE. - PLAN AHEAD Make arrangements early as possible before trip. Work with airlines, cruiselines, etc. Do your research of country you are planning to visit to see if similar law exists ir provisions that country or city has made. I found once we reached some downtown areas in Mexico the sidewalks have curb cuts at each intersection. I",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 103,
      "chunk_index": 1,
      "chunk_text": "found out the hard way. Make sure you are dead center when going up the curb cut you are approaching fr the next block or you might tip over as I did in the waterfront street in Cozumel. There a half dozen Mexican men sitting on wall smoking but they hopped ss if shot from a cannon, checked on me and helped me stand up and they got my scooter upright. I then realized after granddaughter saw it that I busted center seam of a brand neecpsir of nice slacks from waist band to crotch. First and last time worn as once back in stateriomn l threw them",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 103,
      "chunk_index": 2,
      "chunk_text": "away as fabric was ruined.",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 104,
      "chunk_index": 0,
      "chunk_text": "From a community member: Has anyone been to Maine? I’m disabled and my boyfriend wants to go. Any info is appreciated.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 105,
      "chunk_index": 0,
      "chunk_text": "Has anyone experienced accessible train travel on Amtrak? I understand that overnight accessible sleeping cars are available. Any travel tips or insights would be appreciated. Looking to take The Empire builder train to Sand Point Idaho.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 106,
      "chunk_index": 0,
      "chunk_text": "Hi, I’m New to this site. I am a 49yr old female with multiple sclerosis & have been in a w/c for about 3-4 yrs now. I am married with 2 adult sons, ages 21 & 26. I used to be a labor & delivery nurse which I miss. Wanting and anxious to learn any travel tips & tricks as whenever we go somewhere it just never goes smoothly in re to flying & “handicapped” hotel rooms.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 107,
      "chunk_index": 0,
      "chunk_text": "I seem to remember a discussion about a service that books accessible BNBs. Maybe it was a conversation about AIRBNB vs. VRBO on their accessibility options. AIRBNB seems to have the best selection of options, but even asking for a stepless front entrance can narrow your choices from hundreds to 3. Can someone point me to that discussion? Or does AccessibleGO have those kinds of properties?",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 108,
      "chunk_index": 0,
      "chunk_text": "From a community member: Does anyone travel by plane or ship? I have a new travel fold-up scooter now. It’s supposed to be airplane accessible. I’m a little concerned about how it all works at airport. Does anyone have any ideas or suggestions?",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 109,
      "chunk_index": 0,
      "chunk_text": "Hi, Has anyone had luck renting a wheelchair accessible home on the Jersey Shore, NJ (ideally down near Cape May area) or another East Coast (Delaware beaches, Rhode Island coast, etc) ocean town? We arent having luck with Air Bnb or Vrbo-& think we may have more luck with local rental agencies who have a long established reputation versus one time Airbnb type hosts (also if the house doesnt end up being accessible when we got there, a local agency could help us find another one vs an airbnb host wouldnt)-we also use a fully electric hospital bed at home for our loved one-so having a bed that",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 109,
      "chunk_index": 1,
      "chunk_text": "could go go up and down at the head at least and also fit a hoyer lift under it would be helpful-ive heard of companies like Clouds for Good could deliver these if needed? even if we found a regular bed that has the head go up and down and we brought our own foldable hoyer lift in a wheelchair van, that could work-would be nice to be in/near a town that has an accessible place to see the beach and/or rent wheelchair beach chairs-has anyone heard of beach chairs brands/models that tilt back and/or have lateral supports (like a tilt in space wheelchair)? alot of the rentable",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 109,
      "chunk_index": 2,
      "chunk_text": "beach wheelchairs dont look to have anything but flimsy narrow plastic arm rests on the side-thanks for any help/insights!",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 110,
      "chunk_index": 0,
      "chunk_text": "My husband does digital work and could conceivably get a digital nomad visa. Our son is 18 and in a manual wheelchair. Seriously…is there any country beyond Canada that would have any level of decent accessibility? right now, options are: Malaysia Thailand Vietnam Dominica (the island, not the Republic) Grenada Guatemala (Antigua) Spain Portugal Thanks!",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 111,
      "chunk_index": 0,
      "chunk_text": "We are looking for a lake front property that is accessible for someone in a scooter. My scooter friend is able to walk about 15 steps. No stairs. There needs to be a roll in shower and the ability to get near to the lake, not perched on a hill with a frightening slide to the water. We have been looking for too many years. Willing to travel from Maine to New Jersey. A kitchen would be great, but the necessity is the fridge. Please, if you know of anything, please post. Thanks.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 112,
      "chunk_index": 0,
      "chunk_text": "My daughter and I plan to attend some of the 2024 Olympic Games in Paris. I was looking for some suggestions on tourist attractions that are wheelchair accessible? I am also looking for suggestions and helpful advice/tips(restaurants etc) from other people who have already been to Paris. Feel free to post links to information as well.",
      "handicap": 1,
      "pet": 0,
      "child": 1
    },
    {
      "review_index": 113,
      "chunk_index": 0,
      "chunk_text": "Hello everyone, I'm married with four grandchildren & love to go camping. Challenges: To find the right accessible camper, trailer & cottages in the Ottawa or near. ..................................HAPPY CANADA DAY.................................",
      "handicap": 1,
      "pet": 0,
      "child": 1
    },
    {
      "review_index": 114,
      "chunk_index": 0,
      "chunk_text": "From a community member: I’d really appreciate it if someone could let me know what type of vans can pull a 10,000 lb trailer and get into parking ramps? Should it be a big van or a truck? Thank you",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 115,
      "chunk_index": 0,
      "chunk_text": "Mark your calendars for August 19th! accessibleGO is excited to announce an exclusive text-only Q&A event in our Community Forum, offering you the unique opportunity to connect directly with the tourism team from Experience Kissimmee. ﻿ ﻿ This interactive event is designed to provide invaluable insights into accessible travel options in this vibrant Florida destination. You can start asking your questions in the comments section of this Community Forum post leading up to the event, and the Experience Kissimmee team will answer them on August 19th between 9am-5pm ET. Join us for this special digital event on the accessibleGO Community Forum! Experience Kissimmee Digital Q&A: Date: August 19",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 115,
      "chunk_index": 1,
      "chunk_text": "What to expect: Engage with the dedicated Experience Kissimmee Team, exploring Kissimmee’s diverse offerings, from world-famous theme parks to natural wonders and learn about accommodations tailored to every need. Get inspired with questions like: What are some outdoor experiences in Kissimmee for nature lovers? Which local hidden gems give visitors a taste of the “real Florida”? Are there any attractions best for travelers with sensory sensitivities? What local restaurants or dishes reflect Kissimmee’s cultural flavor? What types of accommodation are available for every budget? What makes Kissimmee a top destination for multigenerational family vacations? Are there any themed dining experiences or places with entertainment while you eat? Plus,",
      "handicap": 0,
      "pet": 0,
      "child": 1
    },
    {
      "review_index": 115,
      "chunk_index": 2,
      "chunk_text": "participate for a chance to win incredible prizes!* Grand Prize: A complimentary 3-night stay (off-peak, valid for one year) in an an accessible vacation home near world famous theme parks, provided by FUNSTAY Homes. This single-level home, just 10 minutes from theme parks, features wide doorways, grab bars, a walk-in shower, no stairs and wheelchair-accessible entry, making it perfect for families, seniors and multigenerational stays. Runner-up Prize: An Old Town Swag Bag, valued at $50, which includes a coupon book and two pairs of tickets to select attractions. Explore the lively Old Town Entertainment District with its shops, restaurants, classic car shows and amusements. *Winners will be chosen",
      "handicap": 1,
      "pet": 0,
      "child": 1
    },
    {
      "review_index": 115,
      "chunk_index": 3,
      "chunk_text": "at random from those who participate in the Q&A. ﻿ ﻿ You are in for a real treat with SIX (!) Experience Kissimmee Team Members on hand for Q&A:Jason Holic, Chief of Destination Stewardship ﻿ ﻿ Jason, an innovative thinker and strategic executive leader, oversees organizational technology planning, research projects, strategic planning, community engagement, as well as sustainability and accessibility initiatives. His tireless efforts have led to many notable achievements, including a HSMAI Gold Adrian Award for works associated with www.experiencekissimmee.com and the TravelAbility Accessibility Champion award. His top recommendation in the destination is to enjoy local sights, sounds, and flavors at the many downtown events in Kissimmee",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 115,
      "chunk_index": 4,
      "chunk_text": "and St. Cloud. Prior to joining Experience Kissimmee, Jason managed digital marketing and analytics initiatives for Universal Orlando Resort, where he earned an Excellence in Leadership Award while spearheading impactful online advertising strategies, customer segmentation projects, and cross-channel sales modeling. When away from the office, Jason wastes no time in playing with his sons, leading their Cub Scout Pack, and going on date nights with his wife. An award-winning home brewer, Jason is also a big fan of running, gardening, and grilling. His ideal “life menu” involves an evenly distributed serving of salt air, mountain air, and city air. Jason’s dream travel plans are to check off his",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 115,
      "chunk_index": 5,
      "chunk_text": "bucket-list visits to the lands of his ancestors in Slovakia, Germany, and Poland. Jason holds a Master of Mass Communication from the University of South Carolina as well as a Bachelor of Arts in Advertising/Public Relations from the University of Central Florida. Deirdre Shaw, Destination Stewardship Manager ﻿ ﻿ An avid traveler whose global experiences have shaped her belief that truly great destinations create a sense of belonging for every visitor, Deirdre serves as the Destination Stewardship Manager for Experience Kissimmee. She is dedicated to fostering a sustainable and welcoming environment for visitors of all abilities. Her approach is built on 18 years of experience in public health",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 115,
      "chunk_index": 6,
      "chunk_text": "and economic development, where she has focused on creating community-wide access to health and economic opportunities, from the Alaskan Arctic to right here in Florida. When she’s not focused on destination development, you can find Deirdre planning her next international adventure or exploring the local plant-based food scene. As a long-time vegan, she's passionate about finding and sharing the best hidden gems for conscious eaters. Her personal travel goal is to visit every continent and experience the rich diversity of cultures and cuisines along the way. Deirdre holds a Master of Arts in International Trade and Development from Eastern Michigan University and a Bachelor of Science in Natural",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 115,
      "chunk_index": 7,
      "chunk_text": "Resource and Environmental Economics from the University of Florida. Emily Shorrock, Director of Industry Partner Relations ﻿ ﻿ Emily Shorrock holds over 12 years of experience in Industry Partner Relations, during which time she has excelled in connecting local tourism businesses to the Experience Kissimmee team and other stakeholders, leading to significant impacts on advertising sales and revenue. Notably, Emily has established and measured dues structures and rates for $2.5M annually. She also played a pivotal role during the creation of ad sales products that her team achieved over $130K in in-house sales within the first year. Emily, a native Floridian and member of the Experience Kissimmee Cares",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 115,
      "chunk_index": 8,
      "chunk_text": "Task Force, is committed to promoting environments of growth and collaboration in the Central Florida area, as evidenced when implementing numerous successful programs that included Partner Spotlight, Partner Orientation, Explore Kissimmee, and VIBE. Credentials include a Bachelor’s Degree in Business Management from the University of Phoenix in 2009. In April of 2020, Emily attained Hospitality & Tourism Management Certification from Florida Atlantic University. Emily can’t live without music. She loves all types of music if you don’t include country. If the right song is playing, you will likely catch her dancing in her living room or any other location. An ideal day is listening to music while hanging",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 115,
      "chunk_index": 9,
      "chunk_text": "out at the pool or beach with her husband, son, and daughter. In the future, she would love go on a vacation to Australia and swim in the Great Barrier Reef. Having fun and being silly are always priorities for Emily and it is no wonder that she is often referred by colleagues as the “Office Cheerleader.” Jax Alberto, Industry Partner Relations Manager ﻿ ﻿ Meet Jax Alberto, Industry Partner Relations Manager at Experience Kissimmee. She’s been with the team for six years, making sure our partners are connected, informed, and helping create unforgettable—and inclusive—experiences for every visitor. As an accessibility champion, Jax is especially passionate about making",
      "handicap": 0,
      "pet": 0,
      "child": 1
    },
    {
      "review_index": 115,
      "chunk_index": 10,
      "chunk_text": "sure everyone feels welcome and empowered to explore Kissimmee. A UCF grad with a degree in Interpersonal and Organizational Communications Jax is all about building community and sharing what makes this destination special. When she’s not working, you’ll probably find her at a local diner or theater show, listening to a true crime podcast, or hanging with her two Siberian cats, Ygor Manuel and Trebek Rizzoli. Need a coffee rec or thinking about your next tattoo? Jax is your go-to! Tiffany Cookro, CRM Specialist ﻿ ﻿ I’m passionate about making tourism more inclusive and welcoming for everyone. As a mom to an autistic daughter, I understand the importance",
      "handicap": 1,
      "pet": 0,
      "child": 1
    },
    {
      "review_index": 115,
      "chunk_index": 11,
      "chunk_text": "of accessible travel and thoughtful hospitality. I’ve been with Experience Kissimmee for over four years and spent a decade at Walt Disney World, where I developed a deep love for creating joyful, barrier-free experiences. With six kids who’ve each visited at least 26 states (some even more!), I’m all about helping families explore the world together. On weekends, you’ll find me volunteering at a goat yoga farm, caring for over 50 goats (plus emus and a donkey). I lead volunteer training, keep the animals happy, and make sure every guest leaves with a smile—and maybe a little goat hair on their clothes. Leanne Hoag, Advertising Sales Coordinator ﻿",
      "handicap": 1,
      "pet": 0,
      "child": 1
    },
    {
      "review_index": 115,
      "chunk_index": 12,
      "chunk_text": "﻿ Leanne Hoag is the Advertising Sales Coordinator at Experience Kissimmee, where she helps partners unlock the full potential of their benefits—ensuring every guest has an unforgettable visit, including those requiring accessible experiences. With over eight years of hospitality expertise and a deep commitment to inclusive travel, Leanne is passionate about uplifting partners so they can create welcoming environments for all. A graduate of Grand Valley State University with a degree in Hospitality and Tourism Management, Leanne believes in the power of shared experiences to connect people. When she’s not working, you’ll find her adventuring with her dog Paris, discovering new dining spots, or mapping out her next",
      "handicap": 1,
      "pet": 1,
      "child": 0
    },
    {
      "review_index": 115,
      "chunk_index": 13,
      "chunk_text": "travel destination.This event is a fantastic opportunity to gather essential information for planning your next accessible trip. Don't miss out on this valuable discussion and your chance to win! Visit this Community Forum post and start asking your questions in the comments section!We can’t wait for you to join us!The accessibleGO Team",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 116,
      "chunk_index": 0,
      "chunk_text": "I have been asked to be one of the sites Travel Forum Experts and I must say that I am honored to be chosen to fill this role. A little about myself. I sustained a Spinal Cord Injury in an auto accident back in 1968 when I was four years old and have been using a manual wheelchair to get around ever since. My injury is at the T-12 level which basically means I am totally paralyzed from the waist down. I successfully completed my education up to the Masters degree level and have been working in the field of human services for most of my professional life.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 116,
      "chunk_index": 1,
      "chunk_text": "My wife and I live in a semi-rural area outside of Philadelphia Pennsylvania along with our two dogs. I have been lucky enough to be able to travel quite extensively both for leisure and business purposes and have been to a majority of the States in the US and several countries in Central and Northern Europe as well. We have also started cruising and have been on two so far and have one scheduled for April of this year. Bucket list for travel is Southern Europe, Hawaii and Asia, Please feel free to reach out to me with any questions you may have and I will do my",
      "handicap": 0,
      "pet": 1,
      "child": 0
    },
    {
      "review_index": 116,
      "chunk_index": 2,
      "chunk_text": "best to answer them. Travel is an amazing thing and I hope everyone can experience it. Cheers!",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 117,
      "chunk_index": 0,
      "chunk_text": "For a member of our community: Can anyone recommend an accessible hotel in either Atlantic City or Syracuse where there is space under the bed for a hoyer lift (and roll in showers available)? Syracuse is for an upcoming August trip while Atlantic City is for trips throughout the year. Thanks everyone!",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 118,
      "chunk_index": 0,
      "chunk_text": "We're making a trip to Las Vegas over Labor Day. Can anyone recommend a reputable Hoover Dam tour provider? Will have a collapsible wheelchair and can manage a couple short steps up to enter/exit. I have a traveling companion that can assist me. We are not renting a car so cannot make the trip on our own. Hoping for a suggestion. Thanks!",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 119,
      "chunk_index": 0,
      "chunk_text": "I am a quadriplegic. My wife and I will be traveling to Palm Springs in early March. I am looking for someone to bathe, shave, dress me and to get me into my power chair. Any takers?",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 120,
      "chunk_index": 0,
      "chunk_text": "Appreciate the feedback… Driving long distance has become an issue for me, and I need to move my parents from Long Island to Florida. I have movers coming August end. But need to move them physically with an older cat. Two people, with rollators. My dad would prefer a wheelchair. They wear depends but may need help toileting. What are the best transportation services (non-medical) for long distance, or should I try to put them on a plane? Any other ideas? Thank you in advance.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 121,
      "chunk_index": 0,
      "chunk_text": "Do you know of any hotels that have a bed low enough. I am in a wheelchair and am only 5 feet tall. The last two times I went to Albuquerque I was with another person and they were able to help me. This time I will be traveling alone. The last two times the bed was too had & I had to have my sister help me into bed.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 122,
      "chunk_index": 0,
      "chunk_text": "We just visited the Hilton Resort in Quebec City in Canada after a great cruise. However the hotel is terrible for assessable needs. Even though their website promotes assessable, it is NOT assessable! The only thing included was wide door openings. There was no ADA higher toilet. It was extremely low as if designed for a child. There were no handrails around the toilet either. The shower did not have a chair to sit on. The shower had only one hold bar that was opposite the controls and was under the shower head. You could not reach the hold bar while standing by the water controls. We had",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 122,
      "chunk_index": 1,
      "chunk_text": "reserved a one bedroom suite and the bed was so wide that you could not ride a wheelchair or rollator to move upward towards the headboard to get onto the bed itself! We were extremely disappointed in this hotel, especially when we were told that all their “assessable” rooms were the same way. I guess Canada has a different attitude toward assessability. At least we would think that Hilton would understand and mandate their hotels to minimum standards. Use caution when reserving rooms in Canada!",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 123,
      "chunk_index": 0,
      "chunk_text": "Hi - Before covid and my ALS diagnosis, we used to travel quite a bit. Thankfully my disease is slow-progressing so I’d like to travel while I’m still able. I do use a manual or power wheelchair if I will be going long distances and I cannot do stairs/steps. Otherwise, I can still walk short distances using canes or a rollator. Would love to go to Barcelona this summer but have no clue how to figure out accessible places (hotels, restaurants, tourist sites, etc). Would love to get tips from folks who’ve done Barcelona with wheelchairs.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 124,
      "chunk_index": 0,
      "chunk_text": "From a community member: I would like to know where accessible RVs can be rented and purchased. I would greatly appreciate any suggestions or tips.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 125,
      "chunk_index": 0,
      "chunk_text": "I’ve been thinking of a few things that ease travel & thought I’d share in case others might find them handy. Backstory: Decades ago I temped a lady whose husband had left for work one day & vanished, gone without a trace; ~ 15 years ago I went on business trips with a colleague who gave me this tip; & I watch WAY too much true crime as I’m convinced that every solo foray leads to instant serial murder. Anyway, every time the coworker left her hotel room she made a brief note giving the time, date, destination, perhaps expected return. It wasn’t formal or elaborate, just a",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 125,
      "chunk_index": 1,
      "chunk_text": "casual set of facts that would be invaluably helpful in trying to find her if she did in fact go missing. I don’t know if anyone else knew; it would be a good safety measure for almost anyone solo, no big deal, just a voice memo with dates & time erased on return or post-it by the phone or on the door that could be tossed on return, no need to involve others (could also add to dr. appt calendar to keep track of mundane things — ~ how often to bank, hair color, drycleaner, neighbor’s dog running loose, whatever(",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 126,
      "chunk_index": 0,
      "chunk_text": "Just wanted to Say Hello and Introduce myself. I am Tanya and I am now an empty nester. I have fur babies also that are becoming my registered companions. This is a process but needed very much. I have been diagnosed with many ailments but Lupus and It’s Other sister dieases have become the Issue to my life and made me Disabled ten years ago. I woke with no available to move my legs or walk. that story is long one… short version is I went from Wheelchair to auto scooter to two canes to one cane to none. but wish j had one from time to time.",
      "handicap": 1,
      "pet": 1,
      "child": 0
    },
    {
      "review_index": 126,
      "chunk_index": 1,
      "chunk_text": "I fall often and Thank goodness for my Fur babies being there to help me up. Just want to thank you all for listening and know I am supporting you on your journey as well.Thanks for listening and getting to know me and Excited to get to know you all on here.Pain is strong but I am StrongerTanya",
      "handicap": 0,
      "pet": 1,
      "child": 0
    },
    {
      "review_index": 127,
      "chunk_index": 0,
      "chunk_text": "My family has recently moved out of a home I designed and built with accessibility in mind in Nashville, TN. It is now a vacation rental, but I am struggling to connect with the folks that could benefit most from staying there. I have swapped a couple emails with hosts of this site who said they are looking at incorporating homes (vs strictly hotels) down the road. If anyone is aware of good resources currently available to get the word out it would be much appreciated if you shared them with me. Airbnb currently has the best search/filter function of the major booking sites, but it is lacking",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 127,
      "chunk_index": 1,
      "chunk_text": "in detail (and I’m not sure people are aware they can filter for things such as zero step entry, wide doors, curbless showers, grab bars, etc). Here is a link to the home . I’ve received feedback regarding posting the master bed height (and lowering it as much as possible). Any additional input is welcome. Many Thanks, Ryan",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 128,
      "chunk_index": 0,
      "chunk_text": "My son who is autistic LOVES trains, and wants me to take him on the L.A. to NYC scenic tour. Has anyone traveled on Amtrak using their accessibility options? Experience, good or bad? Father and son are going to do this.",
      "handicap": 1,
      "pet": 0,
      "child": 1
    },
    {
      "review_index": 129,
      "chunk_index": 0,
      "chunk_text": "My name is Vicky. I am a 46 year old mom of 4 and have been married 26 years at the end of the month. We don’t travel alot but enjoy when we do. I have fibromyalgia, osteoarthritis, and neuropathy. I struggle at times with migraines as well. I don’t walk very far in public…I struggle to get around because of the pain and neuropathy. I use a scooter in the store but have a wheelchair for when we go places that don’t have them. 5 years ago I got along pretty well but lately things have been getting worse. While I am morbidly obese I get frustrated",
      "handicap": 1,
      "pet": 0,
      "child": 1
    },
    {
      "review_index": 129,
      "chunk_index": 1,
      "chunk_text": "that that is what people think is wrong…that I am just being lazy or something. I am here looking for tips and tricks to making travel easier and more enjoyable.Thanks",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 130,
      "chunk_index": 0,
      "chunk_text": "I’m going to Greece next week. Its a long flight. I am a wheelchair-user. The airline (United) has told me there are accessible bathrooms on the planes. Have any wheelchair users out there successfully used the new accessible bathrooms on planes? Is it a big production? what should I know? Thanks. Carol",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 131,
      "chunk_index": 0,
      "chunk_text": "I have had 2 scooters, both Pride GoGo Elite Travelers, and they have had the same problem. They have times when they slow down and speed up, kind of jerky. I tók the first to a repair place and was told it needed a new transmission for $800. So I bought a hardly used scooter for much less. It developed the same problem. I called Pride (again- 1st time with 1st scooter, didn’t know what was wrong) and was told it was the batteries, and to replace them. After 6 months, the jerky stuff started again. Any ideas, comments, suggestions greatly appreciated. Is it this brand? I think",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 131,
      "chunk_index": 1,
      "chunk_text": "we got gel cell batteries. Is it worth getting lithium? Thanks.",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 132,
      "chunk_index": 0,
      "chunk_text": "So still in Louisville, KY. I rented a power chair at home in Rockville through a company called Cloud of Goods. I am here to tell you they are NOT good. I have had trouble with the rental from a company in Virginia since day one. I spend my time, not enjoying my vacation, but on the phone with technicians who are watching Google videos and then talking to me. I called Cloud of Goods, which was the company I contacted to rent a chair.. I explained my problem to their very skilled customer service agents, who I suspect are not located in the U.S. I have now",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 132,
      "chunk_index": 1,
      "chunk_text": "been on the phone for more than 20 minutes. Draw your own conclusions.",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 133,
      "chunk_index": 0,
      "chunk_text": "I’m looking for a private in-home caregiver in Kona Hawaii for three hours in the morning and one in the evening from March 6, 2025 – March 28, 2025. It could be part-time & relief as well. I am a male quadriplegic. I will be staying in Kona during the duration of our vacation. If interested, and you live in Kona feel free to contact me at timshe52@gmail.com .",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 134,
      "chunk_index": 0,
      "chunk_text": "Hey there! I’m Andrew Kurka! A partial Paraplegic and Alaskan! I broke my back when I was 13 in a ATV accident, I use a wheelchair and loftstrand crutches from enabling technologies. I travel the world regularly with team USA as a Paralympic alpine skier. I have experience in over 20 different countries and different traveling situations. I’m happy to be joining the AccessibleGO team as a representative and resource, if you have any questions. I also own a BnB in Alaska, I am a boat captain and a small plane pilot. I like to accept challenges. The way I see my disability, is like a challenge. Everyday",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 134,
      "chunk_index": 1,
      "chunk_text": "I become better, because I overcome a new obstacle that my disability presents. So I’ll never stop growing. My wife Veronica is my rock, from Guadalajara Mexico and makes sure to keep me grounded so I don’t push myself to far, to often. I’ll be around tomorrow and available anytime if anyone has any travel questions! I’m happy to be a resource to help ease your mind and trouble when traveling! Chances are, I’ve already been there and made those mistakes.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 135,
      "chunk_index": 0,
      "chunk_text": "Mark your calendars for August 12th and 19th! accessibleGO is excited to announce two exclusive digital Q&A events in our Community Forum, offering you the unique opportunity to connect directly with the tourism teams from Visit Lauderdale and Experience Kissimmee. These interactive events are designed to provide invaluable insights into accessible travel options in these vibrant Florida destinations. Join us for these special digital events on the accessibleGO Community Forum! — Visit Lauderdale Digital Q&A: Date: August 12 What to expect: Get your questions answered directly from the Visit Lauderdale Accessibility team, discovering accessible beaches, top attractions and welcoming accommodations in Greater Fort Lauderdale. Get inspired with questions",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 135,
      "chunk_index": 1,
      "chunk_text": "like: ☀️ What’s the best time of year to visit Greater Fort Lauderdale’s beaches? ☀️ What’s our #1 accessible attraction that can’t be missed? ☀️ Which hotel is great for accessibility? ☀️ How easy is it to get around the Greater Fort Lauderdale area? ☀️ Tell us about a hidden gem in Greater Fort Lauderdale that’s welcoming to all travelers? — Experience Kissimmee Digital Q&A: Date: August 19 What to expect: Engage with the dedicated Experience Kissimmee Team, exploring Kissimmee’s diverse offerings, from world-famous theme parks to natural wonders and learn about accommodations tailored to every need. Get inspired with questions like: ☀️ What are some outdoor experiences",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 135,
      "chunk_index": 2,
      "chunk_text": "in Kissimmee for nature lovers? ☀️ Which local hidden gems give visitors a taste of the “real Florida”? ☀️ Are there any attractions best for travelers with sensory sensitivities? ☀️ What local restaurants or dishes reflect Kissimmee’s cultural flavor? ☀️ What types of accommodation are available for every budget? ☀️ What makes Kissimmee a top destination for multigenerational family vacations? ☀️Are there any themed dining experiences or places with entertainment while you eat? Plus, participate for a chance to win incredible prizes! 🎁 Grand Prize: A complimentary 3-night stay (off-peak, valid for one year) in an accessible vacation home near Disney, provided by FUNSTAY Homes. This single-level home,",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 135,
      "chunk_index": 3,
      "chunk_text": "just 10 minutes from Disney World, features wide doorways, grab bars, a walk-in shower, no stairs and wheelchair-accessible entry, making it perfect for families, seniors and multigenerational stays. 🎁 Runner-up Prize: An Old Town Swag Bag, valued at $50, which includes a coupon book and two pairs of tickets to select attractions. Explore the lively Old Town Entertainment District with its shops, restaurants, classic car shows and amusements. — These events are a fantastic opportunity to gather essential information for planning your next accessible trip. Don't miss out on these valuable discussions and your chance to win! Stay tuned for more details on how to participate. We can’t",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 135,
      "chunk_index": 4,
      "chunk_text": "wait for you to join us! The accessibleGO Team P.S. What accessible travel destinations are you most interested in learning about for our next community Q&A event? Click here to send us a message with which destinations you'd like us to feature next!",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 136,
      "chunk_index": 0,
      "chunk_text": "From a community member: My husband had a stroke several years ago. Right side compromised, some aphasia and in a wheelchair, I am his FT caregiver. Since covid, we have taken short local staycations. Right now, he is low on energy. Hopefully, he will feel more like a fun trip again. I’d like to be able to show him what you can do to build more confidence. Any suggestions?",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 137,
      "chunk_index": 0,
      "chunk_text": "Hi everyone! I’m planning a trip to London soon and looking to hire an electric wheelchair to make exploring easier. Ideally, I’d like something portable and comfortable for a full day out. Does anyone have recommendations for a reliable hire service, especially one that delivers to hotels? Would really appreciate any advice. Thanks!",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 138,
      "chunk_index": 0,
      "chunk_text": "My name is Doris and I've been on the site for almost 3mths. Today I decided to make my 1st post. My husband was diagnosed with ALS almost 7 yrs ago and it definitely changed our lives. We really missed traveling so this site has been VERY helpful. We just got back from a cruise on Voyager of the sea. The accessible room was large enough for the power chair, a hoyer lift and we had a hospital bed(which we ordered from Scoot-around). Having the hospital bed made things much easier and comfortable. We'll be cruising again soon",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 139,
      "chunk_index": 0,
      "chunk_text": "The time has come to vote for the winner to be featured in Accessible Journeys magazine! Voting is open TODAY, September 1st, through September 6th and we will announce the winner on September 7th. The first place grand prize winner will be featured in Accessible Journeys and receive a $200 gift card to use at IZ Adaptive The second prize winner will receive a $200 gift card to use at IZ Adaptive We had 6 eligible entries based on our giveaway rules here, so we’ve decided to open up voting to all 6! Now it’s up to our accessibleGO community to decide. The entry with the most votes",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 139,
      "chunk_index": 1,
      "chunk_text": "will be deemed the grand prize winner and the second most votes will be deemed the second prize winner. Please vote only once! (submissions for each entrant can be found in comments below and in original Forum post) hita1lopez mabscall derekegarner gbeanster40 julievandusen pekkapaavonpera 0voters",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 140,
      "chunk_index": 0,
      "chunk_text": "I have a family of 4, and sometimes more when travel with my granddaughter. I required the use of an wheelchair accessible room with a roll in shower. We also foster a young lady with Cerebral Palsy and Developmental disabilities that requires supervision and can’t be left alone. The challenge is finding an wheelchair accessible roll in shower room that will sleep.The second challenge is finding 2 rooms one being an accessible with roll in shower that sleeps 2 and a connecting room.The third and final challenge when traveling with our granddaughter or if our 13 year old wants to bring a friend is finding hotel lodging that",
      "handicap": 1,
      "pet": 0,
      "child": 1
    },
    {
      "review_index": 140,
      "chunk_index": 1,
      "chunk_text": "meets all of our needs. As I all the major house projects are almost done and I’m nearing retirement I plan to travel more and just need lodging. We have went as far as renting entire houses and cabins to meet our needs. We also plan to try and travel abroad.I’m hopeful we are not alone in this struggleBe WellEd",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 141,
      "chunk_index": 0,
      "chunk_text": "1 bedroom house in beautiful Kapaa on the Garden Island of Kauai. You will enjoy a king bed in the master bedroom and queen sleeper sofa in living room. Mounted tv’s in both living room and bedroom. Wi-fi, and printer. Wheelchair accessible shower only no tub. Handrails in shower. Toilet sits 17inch high. Countertop sits 34 in. high with cooktop, Ninja, Ice Maker, coffee pot, Blender, Countertop dishwasher, Countertop ice maker. Wheelchair ramp, private lanai.Wheelchair travel within minutes to beach, shops, grocery store and restaurants in Old Kapaa.We are also pet friendly.Please Contact Darren at 530-545-2111 to check availability and price.The house is currently in final stages of",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 141,
      "chunk_index": 1,
      "chunk_text": "construction and pictures will be ready by tomorrow after final clean",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 142,
      "chunk_index": 0,
      "chunk_text": "I am thrilled to announce that WheelCraft Exclusive Concierge WAV Service has officially filed its Articles of Organization and is now an approved LLC! 🎉 This milestone marks the beginning of a new chapter for WheelCraft, as we continue to striving to begin providing unparalleled concierge wheelchair-accessible vehicle (WAV) services to my valued community. My commitment to excellence in reliable, affordable accessibility remains at the forefront of everything I do and I am excited to enhance the future offerings even further. Being able to provide this service to our community, puts more of a emphasis on the idea of a service FOR US BY ONE OF US! Thank",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 142,
      "chunk_index": 1,
      "chunk_text": "you for your ongoing support and I look forward to trying to serve the disability community, with even more dedication and innovation.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 143,
      "chunk_index": 0,
      "chunk_text": "hi, i have a tip for wheelchair users visiting the UK-but its only useful for those of us with blow up wheels,not rubberised. ill tell you how i found this out, a few years ago, i was using a disabled forum and a user came on explaining that they despratly needed there wheels blowing up and they went into a car/ cycle etc type huge shop/store called HALFORDS. recently,i noticed my wheels were way to soft and low,but there was no leakage,and i typed out to my suport staff about remembering this persons comment from a few years ago. he said lets try it then,so we parked outside",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 143,
      "chunk_index": 1,
      "chunk_text": "HALFORDS, he went in with my wheelie, and they were absolutely wonderful, they looked for the corect PSI first and then pumped them up, and he also noticed my breaks werent fixed properly so he sorted them out it only needed a bit of movemtn and the guy said come anytime you need it sorting, he woudnt take any money and that is the same lovely atittude the person i saw writing on the forum a few years ago. so ive thought,just in case any of you are ANYWHERE in the UK with a HALFORDS nearby, or even if you live here like me or know someone here",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 143,
      "chunk_index": 2,
      "chunk_text": "it coud help-its worth going to unless your able to pump them yourself,i know a few people whove bought pumps from TEMU to do there wheels but i dont know how they turned out.i hope this helps. 🙂",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 144,
      "chunk_index": 0,
      "chunk_text": "Hotels (USA) that offers free airport transportation are they required to offer ADA accommodations? (We will have 2 small scooters at 130 pounds each!) I read somewhere if they can’t help you, I heard they must reimburse you to get to and from the airport as that is our destination. It looks like the van shuttle is big enough for 2 scooters as I don’t have an issue getting them both in the van by myself. Advance thank you for your help on this issue!",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 145,
      "chunk_index": 0,
      "chunk_text": "From a community member: I’m in a wheelchair but I love to travel. I’m adventurous and there’s lots of places I’ve never been that I’d love to go to that has lots of wildlife Any suggestions would be greatly appreciated. Thank you",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 146,
      "chunk_index": 0,
      "chunk_text": "Hi!I’m a wheelchair voyager from Spain. I’ve been in Las Vegas three times and I,ve tried to visit the Grand Canyon two times, but my problem is that I don’t have a car. First time was twelve years ago and I thougfht that the problem with the transportation have been solved, but now, in XXI century, there’s any private company that offers a coach wiith accessible seats, they expected me I go up, I thought it was a joke.Obviously, the Grand Canyon ls not for me",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 147,
      "chunk_index": 0,
      "chunk_text": "This season, we want to thank you for being part of the accessible travel community with our first-ever holiday gift! Book a hotel stay on accessibleGO by December 31, 2022 and we’ll send you a virtual Visa gift card as an extra bonus after you complete your stay. More details on how it works here. Happy holidays to you all, from all of us at accessibleGO. 🙂",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 148,
      "chunk_index": 0,
      "chunk_text": "For my 60th birthday year, Chet and I took my dream trip to Japan. We journeyed as far north as Nikko National Park and as far south as Nagasaki. We saw ancient temples and shrines, wild monkeys, amazing forests, and interesting museums. We ate at 7 11, Family Mart and Lawson convenience stores, restaurants, and local markets. We dipped our toes in the Japan Sea, climbed sand dunes, and even rode a camel. We traveled in a Mini Wink camper van from Japan Campers for three weeks, driving up and down crazy mountain roads, driving through rice paddies, and in the city traffic of Toyoko and Osaka. We",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 148,
      "chunk_index": 1,
      "chunk_text": "camped at Michi No Eki roadside stops and other stops recommended by the Japan Campers app. We hope you will join us on this trip of a lifetime. We had a blast, and I hope you will enjoy joining us through this video series. We also lightly discuss accessibility that we see in our journey. This episode starts our journey from Japan Campers Narita, Japan to Nikko National Park. We spent the morning traveling pass beautiful places including rice fields, forests, stream, and small towns, and spent the afternoon starting our exploration of Nikko National Park. We are Betsy and Chet, and our oldest son, Alex. For 33",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 148,
      "chunk_index": 2,
      "chunk_text": "years, we thought Alex, had nonverbal autism, intellectual disability, ADHD, but a few years ago we found out that he has Phelan McDermid. Alex goes on many trips with us, but this time the plane trip is too far. Part of the reason we make these videos is to share the world with Alex and others who are unable to make a journey to Japan. We have no idea what Alex understands receptively, so videos are a way to visually communicate where we went for three weeks. He likes to use his eye gaze communication device to watch his vacation videos so now in a way he can",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 148,
      "chunk_index": 3,
      "chunk_text": "see Japan with us. Our videos, Goal 1: Joyful Life are based on our family's journey and strategies we use to improve the quality of our life through meaningful leisure experiences. It is our hope to reach our number one goal of having a joyful life and to help others reach that goal too. We are hoping that our videos will encourage everyone to get out and have fun.",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 149,
      "chunk_index": 0,
      "chunk_text": "My name is Andrea and I’m new to this group. My 34 year old daughter has CP and is confined to a wheelchair. I recently retired and my husband and I love to travel with our daughter.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 150,
      "chunk_index": 0,
      "chunk_text": "Hi ,I just found an article on internet, I thought it will helped to ease some worries.The Best Accessible Beaches in Europe, From Barcelona City Spots to Resorts in GreeceEnjoying European beach culture in a wheelchair is easy at these spots, thanks to floating chairs, Seatrac systems, and accessible transport. apple.news The Best Accessible Beaches in Europe, From Barcelona City Spots to Resorts... Enjoying European beach culture in a wheelchair is easy at these spots, thanks to floating chairs, Seatrac systems, and accessible transport.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 151,
      "chunk_index": 0,
      "chunk_text": "Can anyone recommend affordable motorized scooters for trails and sand that can handle large users and portable too?",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 152,
      "chunk_index": 0,
      "chunk_text": "I need to get my daughter who is in a wheelchair from Burbank airport where we fly into up to a Spina Bifida Camp in Lake Hughes, CA which is an hour north of there. I need to get get her there on a Sunday and pick her up on a Thursday. I don’t know if I can rent a vehicle just for the day each day or what other options there are because I don’t want to pay or have to drive it around in LA that week while I stay in the state while she is there. Any ideas or companies people know could help, please",
      "handicap": 1,
      "pet": 0,
      "child": 1
    },
    {
      "review_index": 152,
      "chunk_index": 1,
      "chunk_text": "let me know.",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 153,
      "chunk_index": 0,
      "chunk_text": "The accessibleGO community forum is where travelers with accessible needs gather to make new friends while they share tips, recommendations, and resources. Every day there are great conversations, and each week we’ll share some of our favorite highlights. Question : Who are the best, most reliable REGIONAL accessible van rental companies? MobilityWorks was a big winner for our community. They offer regional rentals across the US. According to their website, “MobilityWorks offers wheelchair accessible van rentals to help you decide which accessible vehicle fits your needs. We also have wheelchair van rentals available to help you with occasional transportation needs — locally or nationwide. You can rent for",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 153,
      "chunk_index": 1,
      "chunk_text": "a day, a weekend, or longer.” Wdavidstone shares: “I have had a positive experience with MobilityWorks in Nashville, TN. I think they are probably the only option here. I talked to them in the past 2 weeks and they are currently totally booked for July. I have also had a positive experience in Atlanta with AMS Vans.” Charliemitts recommends: “We recently used MobilityWorks in San Diego. Was a wonderful experience. They now have it set where you can pick and drop off at the airport. Mobility Works is s nationwide franchise that it is in most major cities. “ Patty Mayer also had a positive experience: “ MobilityWorks",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 153,
      "chunk_index": 2,
      "chunk_text": "in San Diego CA has been very accommodating for us. Nice vans. Call ahead and reserve. They are currently trying to have their rentals right at the airport but had not been approved to do so as of April 1, 2023. We needed to get a wheelchair service to transport us to and from from airport to MW, which was very good but pricey on top of renting too.” United Access also got several votes. Jstorky1 shares: “United Access in Portland Oregon near the airport was good. I have been disappointed in the quality of vans we rented at Wheelers in Seattle. Got an old dented white van,",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 153,
      "chunk_index": 3,
      "chunk_text": "my wife used the grab strap on the ceiling to get into the van and it pulled off and we had to pay for tge whole cost of repair. Some of the vans we rented in Maui had service lights lit up on the dash and bald tires. The proximity to the airport was the main reason we used Wheelers. They have pretty much a monopoly in Hawaii. I haven’t tried other companies in Seattle.” AMS Vans got a shout-out, as well. They serve the Atlanta Phoenix, Houston, Cincinnati, and New Jersey areas. Atlanta - 800-775-8267 As did Wheelers , who bill themselves as “Your go to resource",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 153,
      "chunk_index": 4,
      "chunk_text": "for daily, weekly, weekend, and monthly handicap van rentals\".” Is there a regional van rental service you’ve used? Sound off in the comments below. We’ll keep updating the list for all to use.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 154,
      "chunk_index": 0,
      "chunk_text": "Looking for a travel companion. Must pay your own way. I live in kansas and have a electric wheel chair and hate to be alone. I’m a widower, live alone. And ready to get out out and about. Please get a hold of me if interested. Open to all parts of the country. Mark L.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 155,
      "chunk_index": 0,
      "chunk_text": "We had originally planned a one night stay in Vienna on the way from Krakow to Munich. But we chose to leave Krakow early because of it was not for wheelchair users. We forgot to factor in that Vienna is super busy because of the Christmas markets there. So I went hunting for a hotel. Vienna was booked solid. I finally went to sleep at midnight with no reservations. I woke at 7 a.m. and checked again. There was a hotel, near the train station, that had an open room. I booked it and we departed Krakow. *Be sure to check carefully what train station you are arriving",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 155,
      "chunk_index": 1,
      "chunk_text": "and departing from, there are many. We arrive and find the Prizeotel by Radisson about a block from the train station. Easy to walk to. It was clean, efficient, and very wheelchair friendly. The only bad thing I can say about it is that it didn’t have an in-room coffee maker, but you could buy some in the lobby. Bed height was perfect, the shower was amazing, the staff great, very reasonable compared to other hotels. For years Paris has been my favorite city. Move over Paris, with Vienna’s wheelchair accessible subway, trams and buses I think I have a new favorite. The architecture is stunning. The people",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 155,
      "chunk_index": 2,
      "chunk_text": "were friendly. The museums were mostly accessible. The Christmas markets are each different and beautiful (also packed). We visited the Belvedere Place to see the Klimt exhibit and the Military museum. Mostly we wandered around muttering ooohhh, ahhhhh. As with all cities this old there was a hunt for food that I could access. It is there but our budget was taking a hit, again, so we often visited bakeries, groceries and at in our room. We went 48 hours before our train trip to Munich. We then reported 20 minutes ahead of our train and off we went. We had a connecting train in Salzburg that we",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 155,
      "chunk_index": 3,
      "chunk_text": "missed because the staff in Vienna didn’t notify the Salzburg staff of the wheelchair. But we got on the next train even though they said all the wheelchair spaces were booked. We were ushered into a wheelchair space anyway and rode the rest of the way to Munich. ***I forgot to mention that we spent the last night in Motel One across the street from the train station. A wonderful choice for wheelchair users. Also reasonably priced. ***If you are ever in Vienna and the wheel breaks on your largest suitcase you can get it repaired at Taschendoktor, Stumpergasse 36, 1060 Wien, Austria. Ph +43 1 5978701. The",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 155,
      "chunk_index": 4,
      "chunk_text": "owner said it would take a week but when my husband said we were gone in 3 days he had it ready in 2 days. A 50 euro hit but much less than the cost of a new bag.",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 156,
      "chunk_index": 0,
      "chunk_text": "Last week, the Minneapolis- St. Paul International Airport, in conjunction with Delta Airlines, opened a new mock airplane cabin for people with cognitive, psychological and physical disabilities and for trainers of service animals in order to provide an experience of what it feels like to fly. The mock cabin is called the MSP Travel Confidently Education Center and is the latest part of the airport’s Navigating MSP program, which helps travelers with disabilities. Thanks to our partner Open Doors Organization in Chicago for sharing this great information! ODO is an active member of the MSP Travelers with Disabilities Advisory Committee. We’d love to hear your thoughts on this",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 156,
      "chunk_index": 1,
      "chunk_text": "new mock airplane cabin- is this something that you would benefit from? Have you ever tried a mock cabin before? Photo credit: Open Doors Organization",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 157,
      "chunk_index": 0,
      "chunk_text": "I currently live in IL. I work in healthcare, am 50 yrs old, and diagnosed with a slow progressing form of ALS(PLS) at 46. I’ve been a traveler my entire life. I’ve lived in several states across the US and have visited 4 of the 7 continents. I use a power chair 80% of the time and use a walker in my home and sometimes at work. I joined this group because I have 3 continents to go and I also travel some for work. As many have mentioned, accessible is defined differently and it’s frustrating to have to ask so many questions to ensure you are on",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 157,
      "chunk_index": 1,
      "chunk_text": "the same page with the hotel, airline, or venue. I am looking forward to searching the various topics to gain insight on my next adventure. Best wishes to all!",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 158,
      "chunk_index": 0,
      "chunk_text": "Bryson City If you are looking for a smokey mountain getaway that is accessible, try Bryson city. Wife and I found it easily navigable. Friendly and the gsmr was hc accessible",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 159,
      "chunk_index": 0,
      "chunk_text": "Today in Barcelona I saw the most amazing accessibility invention. I have wanted to shop but many stores have steps going into them. I was bummed. I went in becaused a sign said it was accessible. People sitting on the stairs got up and moved. The stairs actually collapsed into a flat lift when a button is pushed. I’ll try to post a picture, I hope it works.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 160,
      "chunk_index": 0,
      "chunk_text": "This morning I went on a fantastic snorkel trip out of Kona Hawaii. The boat was wheelchair accessible, the staff super nice and helpful, the fish beautiful. The company’s name was Body Glove. They have numerous water devices if you prefer not to actually snorkel. Ok, I didn’t use the stand up paddle board as a RAKA, lol. The boat has stairs (not a ladder) down into the water so I could easily access in and out of the water using my butt. FUN!",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 161,
      "chunk_index": 0,
      "chunk_text": "Hello! We will be traveling to Orlando soon to get my son a service dog from Canine Companions. We are planning on dividing the trip in to 2 days. We are looking for an accessible hotel around Valdosta Georgia. Does anyone have any recommendations? Heather Hooper",
      "handicap": 0,
      "pet": 1,
      "child": 1
    },
    {
      "review_index": 162,
      "chunk_index": 0,
      "chunk_text": "Bed height has become a major stressor in my travel. Height of the bed used to never be an issue. My major concern was a flip down shower bench in the shower. I don’t travel a great deal so I’m not really sure when this happened. The last hotel I stayed at was a bad experience. I had sent a picture showing a yardstick and the 26\" height of my home mattress and my knee right next to it while seated in my manual chair. When I arrived, hotel mattress was way too tall, had a very cushy top and some kind of side board frame that kept",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 162,
      "chunk_index": 1,
      "chunk_text": "me from getting right up next to the mattress to transfer… NOT good. I called to have it lowered and they basically put the mattress on the floor. Again, NOT good. They finally ended up with the mattress on some type of plastic crates. Closer to right height but side rail and cushy top still made transfer very awkward and very stressful since I was traveling alone. Any hopes of getting a standardized height for beds?",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 163,
      "chunk_index": 0,
      "chunk_text": "PRIOR TO ARRIVAL There were multiple contact points prior to our arrival. I was booking 3 rooms for 3 families. At the suggestion of the reservation agent, I booked 3 individual rooms: a Spa Studio 1 king, a Spa Studio 2 queens and 1 bedroom Spa Villa Suite. I explained to the agent that for the Villa Suite I needed some handicap accommodations. Basically, I need a shower chair, adjustable shower & elevated toilet with grab bars. I called multiple times to confirm that these accommodations were doable. the room. No one mentioned stairs to get to the spa studios until about a week prior to our stay.",
      "handicap": 1,
      "pet": 0,
      "child": 1
    },
    {
      "review_index": 163,
      "chunk_index": 1,
      "chunk_text": "HANDICAP PARKING There was no handicap parking near our room. The curb to the parking area is not wheelchair or cane friendly. In order to avoid a dangerous fall, my husband had to leave me sitting in a wheelchair at the curb, & then drive onto the sidewalk to pick me up or let me out. When I inquired about a handicap space, no one seemed to have an answer. Training for the front desk & operators may be helpful. DISABLED ROOM After check in, they finally brought in a shower chair, but no shower mat. This is a huge fall risk for any guest. There are no",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 163,
      "chunk_index": 2,
      "chunk_text": "bars in the shower & the shower head does not come down. The toilet riser was very loose & unsafe to use, & was delivered late. If you sat down the item would move out of place. This is a massive fall hazard. When I made the reservation I explained exactly what I needed in a hotel room; bars by the toilet, raised toilet, a portable shower chair, bars in the shower, but not necessarily an ADA room. We had to wait for shower mats, shower chair and toilet riser with arms. DANGEROUS GROUNDS The property is not handicap friendly! Or even safe for a disabled person. The",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 163,
      "chunk_index": 3,
      "chunk_text": "property is very poorly lit & there are many areas with over grown brush & uneven pavement that made it difficult & dangerous to maneuver with a wheelchair or cane. There were multiple areas where a wheelchair could not get by. I sent this in writing to the Director, it is now 9 months later and he has yet to contact me. He keeps saying he wants to connect with me. Any of these areas of concern are fixable I let him know that I preferred to settle the situation directly with the property rather than write a totally negative review. He obviously does not care his guest's",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 163,
      "chunk_index": 4,
      "chunk_text": "safety.",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 164,
      "chunk_index": 0,
      "chunk_text": "My husband and I were taking a quick trip to Washing DC over Labor Day. We decided to try a more central hotel than our usual. I found The Sofitel at a great rate through accessibleGO. When I went to book it the wheelchair accessible room was already booked up. Being a nice hotel I figured a regular room would do. Thanks to Patch for going above and beyond I got into the wheelchair accessible room. I have to say in all my travels I have never seen a truly luxury accessible room until now. I messed up my camera so no pictures. There was enough room to",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 164,
      "chunk_index": 1,
      "chunk_text": "get in, turn, park the chair for recharging. A nice loveseat area to relax. The bathroom was one to dream about. There was a bathtub with all of the rails and such. I couldn’t use it but hubby had a good hot soak. There were 2, yes 2 showers! Mine was a spacious roll-in with adjustable shower heights and hand held fixtures. The other was a standard with all the same fixtures and a rainfall showerhead. Check in was fast and super friendly. The attached restaurant was very nice. One of our favorite things was the valet service. Such a classy, professional and happy group. To haul my",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 164,
      "chunk_index": 2,
      "chunk_text": "wheelchairs we have a very large truck. When we drove in the valet said that they couldn’t park it in the garage as it was too big. These guys kept it parked out on the street. They moved it around as needed and we had constant access to it. It wasn’t cheap but worth every penny. The Sofitel is very close to the White House, restaurants galore, theaters.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 165,
      "chunk_index": 0,
      "chunk_text": "Hi - my family and I are planning a trip to Barcelona in September. I can walk very short distances but otherwise use a foldable powered wheelchair. Does anyone have information about renting a powered wheelchair in Barcelona in case mine gets damaged on the flight heading over there OR during our stay? Damage to my wheelchair is what gives me the most anxiety about traveling. Any tips about battery charging in Spain also welcome! For ex., what sort of adapter should we bring?",
      "handicap": 1,
      "pet": 0,
      "child": 1
    },
    {
      "review_index": 166,
      "chunk_index": 0,
      "chunk_text": "I just did 2 rooms, same hotel, same beds, one handicap and one not. Mine is $10 more. Frustrating.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 167,
      "chunk_index": 0,
      "chunk_text": "The train ride from Interlaken, Switzerland to Milan was fast and efficient. We wanted a certain route but they told us at the station that that train was not suited for wheelchairs. So we went back through Zurich and down to Milan. The thing I noticed about the trains in Italy were that they were mostly lower. The helper at the station would carry a roll-up ramp and lay it down to cover the gap. If I could add to my luggage pile, without losing a husband, I would love one of my own. Milan is a big city. This was our splurge stopover. We used the Hotel",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 167,
      "chunk_index": 1,
      "chunk_text": "Korner Duomo. It was beautiful. It had the biggest pain in the behind elevator I have ever seen. But the room made up for it. We were literally around the corner from the Galleria and Duomo. We walked across to the Monument Cemetery which was jaw dropping. We did little but wander the streets oooing and ahhhing. We found a little restaurant near the Galleria(Marinos) and ate there every day. They treated us like neighbors. On my birthday (even planners can screw up now and then) we took the train to the Malpensa Airport for the night. We flew to Madrid the next day. Cobblestones are a real",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 167,
      "chunk_index": 2,
      "chunk_text": "pain when in a chair. But I loved all the marble walkways in the shopping areas.",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 168,
      "chunk_index": 0,
      "chunk_text": "Hi Everyone, we have a community member with the following question, can you help? We will be spending 2-4 days in Vancouver in June. Can anyone recommend an ADA 4-star hotel with a walk in shower, hand rails, elevator, etc. ? What kind of transportation is available for a collapsible scooter user, to see the sites? What tourist sites do not involve many stairs, unstable ground, cobblestones or grass or sand? Thank you!",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 169,
      "chunk_index": 0,
      "chunk_text": "I have gone to Barbados in the past and most transportation services want up to $80.00 per hour for accessible transportation. They mostly get the tourist that want to see the sights and tourist traps but I just want to go to and from the airport and maybe to Ositins, to partake in a fish fry without having to pay almost $500.00. An accessible van is NOT a must, as I can lift and assist my wife in a regular van or mid-size car.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 170,
      "chunk_index": 0,
      "chunk_text": "Hoping to make a trip to Honolulu in a year or two. I have a folding electric wheelchair to take along. How do I find a 2 bedroom condo or home to rent that is ADA rated? Any suggestions? Thanks!",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 171,
      "chunk_index": 0,
      "chunk_text": "Alaska is the last frontier, a wild, cold and crazy place with huge animals and insane weather–But it is also where I am from. It’s my home, and it is a large wild home, where exploration is a must, and the outdoors is part of life. Alaska is also concealed from the rest of the world. Blocked off by miles of ocean unless you want to drive for 4 days through Canada. Travel has to be by flight, and when you’re going to fly for 6 hours to get anywhere else, you might as well fly for 12 hours. So when I travel the world, I go far–to",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 171,
      "chunk_index": 1,
      "chunk_text": "the warmest, most adventurous places I can find. ﻿ ﻿ I’m Andrew Kurka, an Alaskan and an Athlete on the US Paralympic Ski Team. I also like to think of myself as somewhat of an explorer. An explorer that is always looking for new and better ways to travel. Being an Alaskan, everyday life isn’t the most accessible. So I found ways, to adapt, to overcome, to continue doing the things I love to do. The hardest part was accepting my differences and my disability, realizing that I could do anything, I just had to do it differently. Then finding those that would support me in those endeavors..",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 171,
      "chunk_index": 2,
      "chunk_text": "The world isn’t built for us, and adapting can be hard. The more streamlined the better. That’s why I am excited to join the accessibleGO team. accessibleGO helps those who are freshly disabled or have had lifelong disabilities, travel with confidence and enjoy themselves on the GO, wherever that may be. ﻿ ﻿ I broke my back when I was 13 in an ATV accident. Prior to the injury I was a wrestler and avid outdoorsman, a hunter, a fisherman. But the things I miss the most about having legs that work, was the freedom, the freedom of being able to just walk outside and GO. Hike this",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 171,
      "chunk_index": 3,
      "chunk_text": "hill, or ski that mountain. When my legs were taken from me, so was a portion of my life, and a portion of my identity. The athlete that was an awesome wrestler, the boy that would bike miles just to find a fishing spot. That person felt taken. For years I had tied my identity to the person who was built around these things, and then they were taken away. I struggled for two years, a young man lost. Alaska isn’t built for the disabled, we have pretty typical ADA standards but they aren’t typically met, especially in the winter time. Alaska, it’s wild! It’s the outdoors, and",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 171,
      "chunk_index": 4,
      "chunk_text": "the outdoors isn’t built for us. It’s the best part about Alaska, but also the hardest part of being disabled. I struggled with these facts, trying to accept the things I loved. ﻿ ﻿ Then, when I was 15, I was nominated to be the Children’s Miracle Network Spokesman for Alaska. I traveled and met lots of other children with disabilities, learned their life stories and was inspired. I met a young man with terminal cancer who especially changed my life. He was 7 years old, but wanted to see and experience everything. He didn’t know how much time he had left, and he was completely aware of",
      "handicap": 1,
      "pet": 0,
      "child": 1
    },
    {
      "review_index": 171,
      "chunk_index": 5,
      "chunk_text": "that fact. He just looked death in the eyes as if to say, “I know you’re coming for me, but I’ll make you work for it.” He was mature for his age, which was scary for me. I was 15, but he seemed like more of an adult. But he also didn’t have any fear, after all what did he have to lose? What did he do to deserve this? Nothing, but he was determined to at least give it his best shot at the life he was given. After meeting this young man, I sat down, and thought about my life. What was I even doing here?",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 171,
      "chunk_index": 6,
      "chunk_text": "Why was I worried about who I used to be, why was I worried about my legs? Why was I sulking in the thoughts of the person I used to be? Instead of living the life of a fearless human that strives to at least experience what he can, while he can. That was when I started trying new things. Instead of focusing on the things that I used to do. I said, what can I do now? Or how can I do this? I started adapting, and in the process. I started living, I started skiing, I started playing hockey, I even started wrestling again. I started",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 171,
      "chunk_index": 7,
      "chunk_text": "fishing, kayaking, hunting, canoeing. I started living life, I began my journey molding my life to my dreams. Seeking the experiences of a lifetime. Though they were done differently, I still did them. I pursued experiences in life and in the outdoors, in every way I could, hoping that it would one day provide me with the means of helping others, like that young man helped me. ﻿ ﻿ Today I own a Bed and Breakfast in Alaska, with multiple ADA accessible cabins, nested on an airstrip. I am working toward finishing my pilot license, I own a saltwater fishing vessel and have adapted my life to what",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 171,
      "chunk_index": 8,
      "chunk_text": "I enjoy. I figured out how to do things with a disability. I am setting my life up so that I can do adventure camps, sharing that mindset and that freedom I have acquired with others. ﻿ ﻿ Andrew with his wife.While I still travel the world on the US Paralympic Ski Team, I am constantly learning to adapt to new situations and travel experiences. I know nothing is perfect but finding the best way to make things work is what I live for. Life will never be easy, but I’ll always remain willing to work hard and try. I have had a successful career as a skier.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 171,
      "chunk_index": 9,
      "chunk_text": "I have received a few paralympic medals and I have been crowned one of the fastest in the world. Yet I continue to pursue another Gold at the Paralympic Games while giving my all, to my business and my life. My journeys haven’t been without consequences, I have broken over 20 bones in my 31 years. But I will continue to push forward, living a fearless life and I hope you will too, in your own way.﻿ ﻿ This is who I am, it is my life, my goals and my dreams. It is the reason why accessibleGO and I have decided to create a partnership. So that",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 171,
      "chunk_index": 10,
      "chunk_text": "we may help to inspire others. So that we can help answer questions that people may be unsure about. We can help make people with disabilities more comfortable away from home. So I can be an example and show you what I have made possible in my life. So that you may also do the same in yours. AccessibleGO can help people realize their possibilities and make those goals easier for them. Not to hold your hand, but to simply help you live the life you’ve dreamed of, filled with experiences, travel, and fun. Those objectives are what we partnered over. The fact that I live and experience",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 171,
      "chunk_index": 11,
      "chunk_text": "everything I can, and we want that to be possible and comfortable for anyone with a disability. Sometimes it’s all about making one person smile, helping them to do that one thing they never thought they would experience again. Or at least giving them that opportunity. Because we should all strive to live and not to merely exist.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 172,
      "chunk_index": 0,
      "chunk_text": "Do I have to check in my walker or is it carry on?",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 173,
      "chunk_index": 0,
      "chunk_text": "We received this question from a community member: Is there an accessible way to visit Yellowstone National Park? This community forum is the heart of accessibleGO, a hotel booking site for travelers with disabilities. Our mission is to make sure travel is accessible and easy for all. Book your next trip with us.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 174,
      "chunk_index": 0,
      "chunk_text": "(Advisory: Although this tour is willing to work with people of all abilities, it is still necessary for safety reasons that participants have strong grip capabilities with hands and arms, no neck issues, and strong swimming skills.) A few years ago when Covid restrictions first started to lift, I grabbed my husband and caught the first flight to Sint Maarten Island that we could get on. When we arrived, we practically had the island to ourselves when it came to tourists and found that tour guides were more than willing to work with me and my physical disabilities since they didn’t have to focus on large tour groups.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 174,
      "chunk_index": 1,
      "chunk_text": "However the one tour I wasn’t able to convince to work with me, was the new tours being offered using Sea Bob’s. (For people who are unfamiliar with what Sea Bob’s are, imagine a hand held jet ski engine that allows divers and snorkelers to fly over or under the water’s surface at speeds that match. Here is a link with more information.) You can’t imagine how angry that made me. My biggest pet peeve is when people make assumptions about what we are capable of. That is something we like to determine for ourselves. So when we got home, I started working on planning our next set",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 174,
      "chunk_index": 2,
      "chunk_text": "of excursions for an upcoming cruise we had booked that was going to be stopping in Aruba. Usually when we visit Aruba just for a day, I always book us on a Motorcycle-Trike* tour that also loves to work with people of all abilities (that is another review I am working on); but I noticed a company, SeaBob Aruba, also offering SeaBob tours and I thought I would make my pitch to them to see about including me in the tour. Not only were they willing to work with me, they started explaining to me how they are very used to working with people of all abilities and",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 174,
      "chunk_index": 3,
      "chunk_text": "would love to have us on the tour. I was so excited, even though the tour was still 7 months away. The day finally arrived when we docked in Aruba and I had my dream day ahead of me; a motorcycle tour all morning and Sea Bob’s all afternoon. The tour company met us right outside the dock and arranged a safe spot for me to load into the car and they were able to fit my entire wheelchair in the back of the van. Lucky for us that we were the only two people booked for the afternoon and ended up with a private tour. After a",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 174,
      "chunk_index": 4,
      "chunk_text": "fast stop to pick up the trailer with the gear, we headed to the beach spot and our tour guides did a tutorial for us about how the equipment worked and how to use it safely in the water; while I worked to get my wetsuit gear on. Once I was ready, the incredibly strong tour guides lifted me up in their arms and carried me safely all the way to the water and carefully set me down and my husband joined us in the water. Once I am in the water I am a strong enough swimmer that I am ok without an aide; but my wetsuit",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 174,
      "chunk_index": 5,
      "chunk_text": "does keep me floating at the surface. We were given our Sea-Bob’s and offered some time to familiarize ourselves with using the devices in the shallower water. As soon as we gave the cue we were feeling good with it, we headed out towards the sunken ship off-shore. On the way out, I took the chance to use the device under the water at top speeds and felt like Aquaman soaring under the water. The only downside was you can only stay under the water for as long as your breath lasts because we weren’t using any breathing apparatus. However this device is also used by scuba divers,",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 174,
      "chunk_index": 6,
      "chunk_text": "so they can be used underwater for extended times if you had the correct equipment. On the way out, the guides pointed out some large turtles under us and I was able to swim right over them. After a few minutes of soaring through the water, our tour guides informed us we had reached the ship. They did forget to mention what type of ship, so I was a little overwhelmed when you look down and see a sunken WWII German warship that was HUGE and cracked in half. Plus everything always looks bigger under the water with your mask on. Once I finally got used to looking",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 174,
      "chunk_index": 7,
      "chunk_text": "down at it, we took turns trying to fly down near it, but it was too deep for my husband and I to get too. Instead though, we were entertained by our tour guides who showed off their underwater superpowers and performed magic flying in and around the ship for the longest time. Was so cool watch and gave me fantasies of someday having that kind of breath control. When we were done exploring the ship, we headed back to an area more known for more large turtles and underwater sea life. This time when we spotted another giant turtle, I managed to swim right next to them",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 174,
      "chunk_index": 8,
      "chunk_text": "for quite awhile. When I started to realize they were not comfortable with the Sea Bobs, I backed off and gave it more space. As we got closer to the reefs, so many fish started showing up that I thought I was in a musical number from the Little Mermaid. I only wish I knew the names of what I was seeing to tell you what was down there, but it was AMAZING! Before I knew it, the time had expired and it was time to head back to the beach. It was so sad having to head back, because my adrenaline was pumping so high from getting",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 174,
      "chunk_index": 9,
      "chunk_text": "to experience all of that. Beyond how cool the Sea Bob experience was, there is something about accomplishing a task that someone else said you were incapable of that gives you this high about being alive and for just that brief moment in time, I have a feeling like I am capable of anything. These magical Seabob devices gave me the ability to reach areas above and under the water that I would have never been able to reach on my own due to my legs not kicking anymore… so I was in love. Plus these tour guides never doubted me and let me try everything without any",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 174,
      "chunk_index": 10,
      "chunk_text": "hesitations, giving me that brief moment where I didn’t have to feel like I stood out with my disabilities. I wish I could explain how good of a feeling that is (to me at least), but as the guides carried me out of the water and back to the van to de-wetsuit; I was overwhelmed and didn’t know if I wanted to cry or just grin because I was so happy. They were just lucky it was too far for me to summersault back to the waters edge or I would have been back on that SeaBob for another lap around the bay. I forgot to mention that",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 174,
      "chunk_index": 11,
      "chunk_text": "they do offer a photo package that was very reasonable and then you get a ton of photos and movies sent to you digitally that is so much easier than trying to photograph yourself at the same time you’re trying to control the Bob. However it might be interesting to also attach your own go-pro strapped to your head for a first-person perspective, but I warn you that you go much faster than you can imagine under the water and not sure if it will stay attached? But definitely get the package because they capture all of the great moments with you in them, not just what you",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 174,
      "chunk_index": 12,
      "chunk_text": "saw happening. To me, this was the most perfect day of activities on an island I could fathom for myself. I got to fly above in the morning on the Trike; and then flew below with the Bob in the afternoon. There was so much adrenaline pumping that I was awake all night just glowing (don’t worry, it wasn’t a sunburn). Not only was the Sea Bob tour amazing itself, working with a company like SeaBob Aruba that understands that people with all types of physical abilities can do way more than we are ever given credit for; meant everything to me. The tour guides were phenomenal as",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 174,
      "chunk_index": 13,
      "chunk_text": "tour guides and as human beings. Felt like we had also made new friends that day too**. So now I have 2 things that I always HAVE to do when I get to Aruba, but I think the Sea-Bob’s have secured my #1 spot. **(And to help my tour guide who could not stop whistling a song he couldn’t remember the name or lyrics to; it was Scorpions doing “Wind of Change.” I hope that helps?) 🏍 Trike Tour Review Coming soon 🏍",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 175,
      "chunk_index": 0,
      "chunk_text": "Hi,My name is Alex, I live in Atlanta GA, I have multiple sclerosis. My ability to walk is challenging between a walker use and power wheelchair for long walk.Anyway I am interested in people with a love of travel despite their challenges. I will be travelling to Barcelona end of September direct flight from ATL.My concern is of course the bathroom, 8 hours fligh or so. I guess I will limit my liquid intake. Anyone in Atlanta or near interested to have a group meeting…coffee, lunch, shows just to a social event . Thank you,Alex",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 176,
      "chunk_index": 0,
      "chunk_text": "I just signed up and am so happy to have found this resource 😄. My husband has MS, currently using a manual wheelchair. We are looking into an electric wheelchair and a van soon so any advice is always welcome. Years ago we used to take family trips to the Outer Banks in North Carolina and rent a house by the beach. With the limited mobility changes we have lately only stayed in hotels with roll in showers but I would love to hear if anyone has found any beach homes along the east coast that would accommodate us and what advice/mobility aides you have used to make",
      "handicap": 1,
      "pet": 0,
      "child": 1
    },
    {
      "review_index": 176,
      "chunk_index": 1,
      "chunk_text": "this work! When we travel he really misses the power lift recliner and the adjustable bed (which helps him to stand to transfer.) Have you ever rented a recliner when traveling? Looking forward to learning a lot from this site!",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 177,
      "chunk_index": 0,
      "chunk_text": "How do I know if my scooter is airplane approved? Its an older one I bought second hand.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 178,
      "chunk_index": 0,
      "chunk_text": "Greetings - my gf and I will be traveling through South America for the last 3 weeks of April. She is able-bodied and I am c5 quadriplegic that can walk with crutches for short distances/durations (like down the aisle of an airplane). We’ve traveled extensively in USA, with a bit of Europe and the Caribbean as well. However I believe this will be quite different because for all of that past travel, we’ve always flown one of the major airlines here (American Airlines, Delta, United, Southwest, etc) and on these airlines the policy is pretty much the same across the board: I’m able to remain in my wheelchair",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 178,
      "chunk_index": 1,
      "chunk_text": "and check it right at the gate I’m allowed to bring a carry-on bag containing medical supplies in addition to whatever the standard cary-on allowance for that specific airline and class of ticket I’m allowed to carry on yet another bag containing my Freewheel (and its parts), which is essentially a 3rd wheel that attaches to my wheelchair allowing me to navigate some rougher terrain …all this for no additional charge. I’m starting to get concerned as we look at flights between countries within South America (ex Ecuador to Argentina) and also flights with the same countries. What I’ve been seeing is some pretty high costs for standard",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 178,
      "chunk_index": 2,
      "chunk_text": "carry-on as well as checked baggage and not much more information on what I’m allowed to bring (paid for or not) medical supplies/equipment-wise. Does anyone know if there is a standard policy in place of any sort with respect to this in South America? Anyone who has done any traveling in South America, any anecdotes to share that might give me an idea of what to expect? Or other tips?",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 179,
      "chunk_index": 0,
      "chunk_text": "If members who are interested in accessible travel are on LinkedIn, I would like to recommend three people to follow:Roberto Castiglioni MBEChristopher Wood MBEAntti SuopajärviThanks.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 180,
      "chunk_index": 0,
      "chunk_text": "Hey y’all. We live in the South and will be attending 2 events in Washington, DC mid-May and early June with 2-2.5 unplanned weeks between events. During this time we’d love to explore accessible state parks, coastal areas, and other areas of natural beauty and quietude northeast of DC, especially those that offer beach wheelchairs &/or trails/towns that accommodate e-bikes. Thanks in advance for any/all suggestions for locations, lodging, and outings! Note: we’ll be traveling in an electric vehicle so recs for fast-charging stations are also greatly appreciated!",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 181,
      "chunk_index": 0,
      "chunk_text": "Hello,I’m Anna from Spain. I’m mad for traveling, I have been many times in the USA and this year I’ve prepared a trip to LA and Las Vegas. To celebrate my anniversari I would like to do a helicopter flight over the Grand Canyon. What do you tell me about that? Is it very difficult for me (whith fordable wheelchair)? Must I reserve from here or it’s better do it in tourism office at Vegas?Thank you!!! :hugs: :hugs: : Anna",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 182,
      "chunk_index": 0,
      "chunk_text": "Hi Everyone! My family is travelling to Orlando (seven: total) and I use a power wheelchair. We are looking for a place that has a roll-in shower in a private en-suite on the main floor of a home. Neither of the temporary stay places provide good search tools to seek out accessible accommodation. Do any of you have a favourite place you have already stayed and it worked out really well? Much appreciated. Greg",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 183,
      "chunk_index": 0,
      "chunk_text": "Hi Everyone - Do you have any suggestions for this member? I was looking at a 2 week tour that began in Rome, visited the Naples area, Greece, and Istanbul. My wife and I would be interested in early October 2023. I use an electric wheelchair and use a walker. Thanks! Feel free to post your suggestions below.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 184,
      "chunk_index": 0,
      "chunk_text": "Almost all hotels have converted to beds on a platform rather than the original metal bed frame! You CANNOT get a Hoyer lift under them! No one thinks about this problem and I bet this site doesn’t either!",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 185,
      "chunk_index": 0,
      "chunk_text": "I’m Nancy, a retired scientist, and I split my days between a portable power chair and rollators. I’ve had bone-on-bone osteoarthritis in both hips since 2018 and have cardiac issues including a mechanical aortic valve, congestive heart failure, atrial fibrillation and atrial flutter. Doctors won’t approve hip replacements because of the heart conditions. Nonetheless, I’m a young 69 y/o and I love getting out and traveling. I’m in Indiana and short trips are easy but few buildings are accessible here. I can load my portable chair into my car with a lift and make it to art class, aquatics and local restaurants. My next project is flying alone",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 185,
      "chunk_index": 1,
      "chunk_text": "to Portland OR for a family get-together. Any help on finding accessible places that are really accessible is much appreciated. I’d also be interested to know if anyone’s aware of organized accessible group travel adventures. Looking forward to learning more about AccessibleGO.",
      "handicap": 1,
      "pet": 0,
      "child": 1
    },
    {
      "review_index": 186,
      "chunk_index": 0,
      "chunk_text": "Looking for information about ADA accessible trails in Rocky Mountain National Park, the Badlands and Black Hills areas of South Dakota, and Devil’s Tower in WY.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 187,
      "chunk_index": 0,
      "chunk_text": "My granddaughter is getting married in a few weeks. She and her future hubs reserved a block of rooms at the Marriott Detroit at the Renaissance Center. When they arranged for the rooms, they provided their contact person with our specific needs, i.e. a mobility handicapped room for one person (son, 34) with a connecting or adjoining room for 2, so we can assist our son as needed. The reservations clerk took note of the wedding party and seemed very competent. When I received email confirmation after the rooms were booked, the following note was at the bottom of the confirmation page: “Detroit Marriott at the Renaissance Center",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 187,
      "chunk_index": 1,
      "chunk_text": "will make every effort to accommodate the below requests, however they are not guaranteed. HANDICAPPED; C1” The hotel front desk refuses to discuss, saying I must use the 800# for reservations. The reservations people say they are powerless to guarantee the handicapped room. My granddaughter has reached out to her contact person who set up the block of rooms, but has been ghosted for over a week. We are only planning to stay one night, so my son can survive an overnight without a shower. What is not negotiable is the installation of grab bars at the toilet, as he is unable to transfer without them. The lack",
      "handicap": 1,
      "pet": 0,
      "child": 1
    },
    {
      "review_index": 187,
      "chunk_index": 2,
      "chunk_text": "of a guaranteed handicapped room puts us in an impossible situation. I can still cancel our reservation, and find another hotel, or we can drive home several hours late at night in unpredictable early March weather, following a long and very busy and tiring day. Has anyone else had this experience with hotel reservations? It seems like a violation of ADA. I am trying not to go nuclear for my granddaughter’s sake, but I am maddened by this policy and the inability to reach anyone at the hotel in a position to effect change. Does anyone have advice on how to handle this situation?",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 188,
      "chunk_index": 0,
      "chunk_text": "I’m a longtime Marriott member. However, their website is unfriendly to people with disabilities. One can’t reserve a guaranteed accessible room on the site. One can’t view whether an accessible room is available. You can’t request such a room until you’ve picked a room type from a list of all rooms (not knowing whether that type actually has an accessible room.). Then your reservation summary says accessible room is a non-guaranteed request. So I guess After a flight one is supposed to just show up at the hotel in a wheelchair and hope they have a room. Shameful.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 189,
      "chunk_index": 0,
      "chunk_text": "Not sure if this is allowed….my husband recently passed away and I have an accessible van that I would like to sell. Please let me know if it allowed to list, it’s a wonderful van in great shape. Thank you, April Griffin",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 190,
      "chunk_index": 0,
      "chunk_text": "We had been to Munich years ago so were a little familiar with it. We booked the Eurostar Book Hotel. It was very close to the main train station. We had an accessible room and it met all the needs we usually look for. I will say Europe in general knows how to do wheelchair accessible bathrooms. The one draw back of the hotel was the front door. It was one big twirling entrance. They really should make an accessible door to the side. I let them know that. Munich was packed. It is Christmas Market season and it was crowded. We have learned that if I want",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 190,
      "chunk_index": 1,
      "chunk_text": "to see more then other peoples legs and backsides we have to visit the markets during the week days. Not as pretty without all the twinkly lights but easier on my nerves. I was proud of myself for not running over too many people, but the urge was real. A person (usually female and young) would look right at me as I was moving through the crowd and then step right into my path and stop. I resisted the urge but it was difficult. On our last day in Munich we were out wandering. A block from our hotel I went to cross the road, yes the pedestrian",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 190,
      "chunk_index": 2,
      "chunk_text": "light was green, and an impatient driver decided that he should have the right of way. Thank goodness my wheelchair is very sturdy. I took a broadside hit from the idiot. My chair stayed upright and I made sure my arms were inside so the injuries were limited. I heard the gasp of the onlookers but not one came to help. So important note **make sure you buy a sturdy wheelchair. Munich was very easy to get around and the public transit is all wheelchair accessible. The helper to get me on the train was very efficient. Our journey had us making a train change in Zurich. Per",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 190,
      "chunk_index": 3,
      "chunk_text": "usual our train was late and we had a 2 hour delay for another train. But the helper there took our bags and stored them for us for free. He gave us coupons to get a coffee or snack on the train too. I would love to come back to Zurich one day if our budget can handle it. Our next destination is Interlaken, Switzerland for Christmas.",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 191,
      "chunk_index": 0,
      "chunk_text": "Hello , I’m a paraplegic and my husband and I want to visit Mackinac City. Does anyone know of a place to stay in or near the city with a roll in shower and bed that is around 24-25 inches high?",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 192,
      "chunk_index": 0,
      "chunk_text": "accessibleGO is spotlighting accessibility-related companies who offer services and resources that serve our community. Today, we feature RightHear , an app that helps visually-impaired people navigate any environment. Introduce yourself and your company: Idan Meir is the Co-founder and CEO of RightHear, an innovative startup on a mission to turn public spaces into accessible environments for people with spatial orientation challenges, including people who are blind or visually impaired. Idan is originally from Israel but relocated with his family to Rockville, Maryland in 2021. Idan holds a bachelor’s degree in Psychology and Business from The Open University of Israel. He loves building companies, running, and eating hummus. Not",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 192,
      "chunk_index": 1,
      "chunk_text": "necessarily in that order. RightHear provides real-time audio descriptions to help the blind interpret and understand their surroundings. They have a free app on iOS and Android, over 2,500 accessible locations worldwide, and an ever-growing user base and community. RightHear has partnered with leading international brands like McDonalds, Microsoft, and Costa Coffee to improve accessibility compliance as well as promote inclusion. Here is a video of the app in action. How did the idea for this company come about? It happened almost by accident. Along with my partner, Gil Elgrably, we had created a technology to offer virtual on-the-spot coupons to shoppers based on Apple’s iBeacon technology. iBeacons",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 192,
      "chunk_index": 2,
      "chunk_text": "are small self-powered Bluetooth transmitters that can be placed on walls and roofs in a retail location. But the business model wasn’t making sense. We needed to build a very large user base for this to work and that was turning into a very large challenge. Then, during a 24-hour hackathon sponsored by the Ra’anana municipality, the Tel Aviv suburb in which RightHear is based, we had an insight. Rather than marketing the app to end users, what if we pitched it to the venues as a way of making their space accessible to people with visual impairment? We didn’t even know if blind people used smartphones or",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 192,
      "chunk_index": 3,
      "chunk_text": "apps since they’re so visual, but we put together a prototype in the hackathon and, the next day, the Ra’anana municipality connected us with several blind people in the city. They were blown away, they were so excited about it, even though we didn’t have a product yet. And RightHear was born! What accessibility challenges does your company help users over come? RightHear mimics the function of a venue’s directory board, whether that’s a sign reading “Macy’s this way, restrooms that way” in a mall, or orienting a visitor inside a university’s administration building. When users with the RightHear app on their phone approach the virtual sign, the",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 192,
      "chunk_index": 4,
      "chunk_text": "app speaks to them about what’s nearby. For example: “The admissions office is 100 feet ahead to the right. Hours are 9:00am to 5:00pm, Monday through Friday” or “Restrooms 50 feet to the left.” Any memorable stories from your community that you'd like to share? A person that your product particularly impacted? You know, we've got this user, Hani. She's one of those people who you just can't forget. One day, she was heading home with her guide dog, but something went off. Her dog got lost, couldn't find their usual way home. Can you imagine the stress? So there she was, a little lost, a little unsure.",
      "handicap": 1,
      "pet": 1,
      "child": 0
    },
    {
      "review_index": 192,
      "chunk_index": 5,
      "chunk_text": "But then, she remembered RightHear was on her phone. She fired it up, and our app guided her safely back home. It's pretty wild when you think about it, right? A simple app turning a moment of anxiety into one of empowerment Ever since that day, Hani and RightHear, we're like best friends. She takes us everywhere she goes, and I mean everywhere - even when she's traveling abroad. New city, new country, new everything, but there's RightHear, helping her find her way, keeping her independent. When you get a story like Hani's, it hits you. It's not just about building a product. It's about changing lives, making",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 192,
      "chunk_index": 6,
      "chunk_text": "people feel more in control, more confident. And that, that's the real magic of what we do at RightHear. Why does accessibility matter to you? I believe that everyone should feel able, included, and empowered everywhere. Therefore, our aim at RightHear is to make the world a more accessible place for everyone. At RightHear, when we say universal access, we mean universal access. Our beacon technology removes physical barriers to access. But that’s not enough – we also want to remove financial barriers to access. This is why our app on iOS and Android is 100% free to users today, and always will be free, it is vital",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 192,
      "chunk_index": 7,
      "chunk_text": "to us to ensure that the benefit of accessibility and independence for users should not come at a cost. What are some of your other favorite accessibility startups in the field right now? You know, we're living in an exciting time. All around us, startups are using technology to break down barriers and build a more inclusive world. It's inspiring, really, to see how much of an impact we're collectively making. Let me share a few of my favorites: First up, we've got OKO by Ayes . These guys are doing something pretty cool. Their app is all about making intersections easier to navigate for blind folks. Just",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 192,
      "chunk_index": 8,
      "chunk_text": "point your phone's back camera at a crossing, and voila, the app picks up the pedestrian signal. A simple concept, but it's really changing the game for people. Next, we've got Lotus Labs . They're taking things up a notch with a wearable ring. No, not like a magic ring, but close enough. You just point with the ring, and you can control stuff at home. It's almost like they're turning us into superheroes, right? And then there's ReBokeh . This one's a bit different, it's for people with moderate vision impairment. The app lets you create custom video filters based on your unique needs and environment. Think",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 192,
      "chunk_index": 9,
      "chunk_text": "of it like adjusting the world's focus to suit your eyesight. It's innovative, personalized, and just plain cool. Each of these startups is challenging the status quo, pushing boundaries, and reshaping how we think about accessibility. And that's the beauty of it all, right? It's not just about building products; it's about making a difference, one innovation at a time. We're not just in the business of accessibility, we're in the business of empowerment. How does somebody access & get started using RightHear? Users can simply download the app on iOS here and Android here . It’s free to download and use, we don’t even require a sign",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 192,
      "chunk_index": 10,
      "chunk_text": "up or login, we collect no personal information on our users. For businesses and venues, we offer a quick and simple solution that allows then to ensure that their buildings are accessible to all people, including those who are blind or visually impaired. We work with companies from local stores and restaurants, museums, hospitals, airports, all the way up to governments, global companies such as Microsoft, McDonalds and others.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 193,
      "chunk_index": 0,
      "chunk_text": "We would love to do a family vacation in May. Thinking of Michigan. Mom and dad and our 3 adult kids. I will have my scooter. Handicap shower preferred. Would love a park with paved trails.Not sure what all to do there. My hubby and kids love adventure. Any advice? Sorry if this is a repeat question, my MS has turned my brain to mush.",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 194,
      "chunk_index": 0,
      "chunk_text": "HI…Iam new here and am posting for my husband. He has no legs and uses an electric wheelchair. We would like to travel without driving there. So air travel would be good. I don’t know what to expect as far as flying. Do they take his chair and treat it like a gate checked bag? Once we get to our destination… how do we travel? are there places that rent handicapped vans? Any info would be helpful… thanks Karen from upstate NY",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 195,
      "chunk_index": 0,
      "chunk_text": "We live in Arizona and haven’t traveled anywhere since the pandemic. We need to see, feel, and hear the ocean. We would appreciate any recommendations. I have done my own research but would really like some first-hand knowledge recommendations. All we need to do is to be able to get in the room with a wheelchair. We can usually make any room work for us. Thank you",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 196,
      "chunk_index": 0,
      "chunk_text": "Jump to final paragraph if you don’t like details… Looking for lodging. Everyone has different needs. My husband is hemiplegic and full-time in a wheelchair. Here are his needs. His wheelchair does a 12” vertical lift. So he can do a slide board transfer in and out of bed as long as the bed top is between the lower and higher setting of his wheelchair seat. (Otherwise, he uses a Hoyer lift which means no platform beds.) That means he needs 35” to the left of the bed for the wheelchair and a moveable nightstand because he can only move to the right, so getting out of bed",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 196,
      "chunk_index": 1,
      "chunk_text": "means I back the wheelchair up to the head of the bed. He uses a Hoyer lift to move to toilet so there must be room for it to move into bathroom and turn to hug the toilet. (44”x22” base) Nice to have: roll in shower with grab bar and attached seat, roll under sink, roll under desk/table, no threshold balcony. As others have said, VRBO and AirBnB either filter to nothing, or accessibility is exaggerated. Photos don’t highlight what needs to be seen so lots of communication is needed, The Hilton Grand Vacation properties look good. Has anyone stayed at their Ocean 22 or Ocean Enclave properties?",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 196,
      "chunk_index": 2,
      "chunk_text": "What are the pros and cons? Open to other ideas. Thanks.",
      "handicap": 0,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 197,
      "chunk_index": 0,
      "chunk_text": "We will be travelling to Las Vegas in fall 2024. Hoover Dam's website states the Exhibit Level and ADA elevator to the observation deck will be closed during our visit. Can anyone tell me how this will impact the experience for someone in a wheelchair? Can one see the awesome exterior views of the dam without access to the observation deck? Thanks for the help!",
      "handicap": 1,
      "pet": 0,
      "child": 0
    },
    {
      "review_index": 198,
      "chunk_index": 0,
      "chunk_text": "Hello, my name is Liza and I run a YouTube channel all about wheelchairs. I did do a video on service dogs. I will post it here. Any questions, let me know. I hope it helps:",
      "handicap": 1,
      "pet": 1,
      "child": 0
    },
    {
      "review_index": 199,
      "chunk_index": 0,
      "chunk_text": "Any suggestions? I am trying to book an accessible vehicle for a trip we are taking in 2024 to England (pick up at Heathrow Airport).",
      "handicap": 1,
      "pet": 0,
      "child": 0
    }
  ]
}